{
  "telephone": "+15036257101",
  "priceRange": "$11-30",
  "name": "Crazy Sushi",
  "address": {
    "addressLocality": "Sherwood",
    "addressRegion": "OR",
    "streetAddress": "16055 SW Tualatin Sherwood Rd",
    "postalCode": "97140",
    "addressCountry": "US"
  },
  "known-for": {
    "Health Score": "78 out of 100",
    "Takes Reservations": "Yes",
    "Delivery": "No",
    "Take-out": "Yes",
    "Accepts Credit Cards": "Yes",
    "Good For": "Lunch, Dinner",
    "Parking": "Private Lot",
    "Bike Parking": "Yes",
    "Wheelchair Accessible": "Yes",
    "Good for Kids": "Yes",
    "Good for Groups": "Yes",
    "Attire": "Casual",
    "Ambience": "Casual, Classy",
    "Noise Level": "Average",
    "Alcohol": "Beer &amp; Wine Only",
    "Outdoor Seating": "No",
    "Wi-Fi": "No",
    "Has TV": "Yes",
    "Dogs Allowed": "No",
    "Waiter Service": "Yes",
    "Caters": "No"
  },
  "categories": [
    "hawaiian",
    "japanese",
    "korean"
  ],
  "review": [
    {
      "reviewRating": 5,
      "datePublished": "2019-10-24",
      "description": "My wife was a little disappointed that our \"usual place\" was closed on her birthday. She wanted such I, and we needed to find an alternative. Fortunately:\n\nDinner was wonderful! We ordered four rolls, and each was delicious. The wait staff was very friendly, the restaurant was clean, and everything was freshly prepared on the spot. The variety of available rolls was impressive, but not overwhelming.\n\nOur personal favorites of the evening were the heart attack and white rolls. \n\nAs it's conveniently near the theater, we plan to be back often.",
      "author": "Chris D."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-18",
      "description": "Nice relaxing ambiance\n\nGood fresh food. We had monkey brain, heart attack roll and white roll. Food was really good and fresh. Love to come here again.",
      "author": "Arsalan B."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-09-17",
      "description": "We wandered into this crazy place unannounced.  Who knew Sherwood had such a top-notch sushi spot.  Very inventive and varied menu, combined with very stellar service, made for a great experience.  When we return for a wine vacation, we will certainly wander in again.\n\nPrices were a-ok.  \n\nClean bathrooms, thanks for that.",
      "author": "Michael G."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-07-02",
      "description": "Awesome place to bring the family and enjoy sushi.  The people are super friendly and the sushi is definitely better than most.  We typically go for a couple of rolls and a sushi platter to share between the adults and the kiddos would enjoy a kids bento plate with edamame.  \n\nBeen here several times now and they've always been welcoming and nice.  Definitely worth trying it out if you haven't been.",
      "author": "Hanson S."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-18",
      "description": "This place definitely satisfied my inner sushi fiend! It's a cozy little restaurant with a very nice ambiance. For our appetizer, we ordered Monkey Brain which was basically deep fried avocado. It was very filling. For the main course, we got the Heart Attack Roll and White Roll. My favorite was the White Roll but both rolls were absolute perfection. Heart Attack Roll is deep fried so you definitely get full fast! Service was quick and efficient which I always appreciate.",
      "author": "Hera S."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-11-30",
      "description": "Hands down best Sushi I've had in Oregon! It's hard to get myself to try anything else now! Very friendly staff and clean too!",
      "author": "Whitney M."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-10-12",
      "description": "Super awesome service!  Red lobster rolls, bento box and kids meals are amazing!  Great sake! Make sure to have your birthday here and let them know it's an amazing experience!  Free healthy dessert for kids!",
      "author": "Wayne G."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-11-02",
      "description": "Amazing Sushi! This is the first time that I came here all the way from happy Valley and this isn't going to be the last time. The food was absolutely amazing. We came here on a Friday night about one hour after they open and the place was absolutely packed. Which was a good thing! But we only ended up waiting about 10 minutes for A seat, and then we ended up waiting 30 minutes to get the food which was absolutely worth it because the sushi was fresh. The service was very very good. The atmosphere was awesome. I highly recommend this place. We got four different rules with tip ended up costing us under $50 which was extremely good. The sushi was absolutely fresh and it tasted amazing. Highly recommend this place if you haven't had sushi before. But remember if you're going on a Friday night I recommend coming at five or 5:30 PM. Because this place is busy which is a good thing because that means The food and the staff are extremely kind and nice! Keep up the good work guys will see you soon!",
      "author": "Dharminder S."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-08-20",
      "description": "I have nothing but good things to say about Crazy Sushi. This is the place I recommend all my friends to go. Not only are they decently priced, but they don't skimp out on the size of the sushi! Their rolls, sashimi and cuts in general are HUGE! They're always so incredibly fresh and the sushi chef's go out of the way to make an incredible presentation. If you order enough sushi, they'll arrange it all on a cute wooden boat and bring it to your table. \nHuge shout-out to their sushi chef Justin! Such a friendly guy, and makes great conversation. If you sit at the bar and he's there, you're one lucky patron. He was nothing but accommodating to my family and served us awesome sushi. Thank you Justin!!",
      "author": "Liz T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-12-31",
      "description": "We are regulars and have been for the last five years. We always order to go. Tonight we got the Monkey Brain appetizer along with sashimi (seriously the care that goes into the accompaniments is just so special), we also had the msg, Hawaiian, red blossom and dynamite roll. The fish is so fresh and the sauces are just to die for. As far as  I'm concerned this is the best sushi place in the PacNW.",
      "author": "Shay Ivan K."
    },
    {
      "reviewRating": 2,
      "datePublished": "2019-06-12",
      "description": "Came here with a friend before going to the movies across the parking lot. I was excited to try the food because of all the high ratings. \n\nThe food tasted fine. I actually don't have any complaints there. Probably well deserving of their high star rating. \n\nBut I was served something bad at this restaurant! I knew almost immediately, while we were at the movies, and my stomach started feeling a little off. (Mind you, this was the only thing I had eaten all day.)\n\nIt got worse as the evening went on and into the night. I ended up throwing up the food (among other details) into the following morning. \n\nI ordered a tempura and teriyaki chicken combo bento, and my friend and I shared a sushi roll. I don't know if something was undercooked or just mishandled during prep or if something was just tainted. My friend did not have the same issue, so I assume it wasn't the sushi roll. \n\nThe only thing preventing this from a 1-star review is that the wait staff was very friendly and the service was quick. But I feel that it's fair to let other customers/potential customers know about my experience afterward.. because it was not a good one.",
      "author": "Melissa B."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-05-29",
      "description": "I am so happy that we tried this place. We live 5 mins away and having a delicious sushi spot nearby is priceless! \n\nEveryone who works here is so friendly. Service is quick and efficient. The place is clean. We never have our empty dirty plates sitting in front of us for more than a minute or two. Inviting atmosphere. Large variety menu. \n\nNow on to the most important part. AWESOME sushi!! Here's been some of our favorites:\n\nGarlic albacore sashimi - a MUST!\nPepper tuna sashimi - clean and tasty\nMonkey Balls - crunchy and satisfying\n503 roll - probably my #1 fav\nTuna on fire roll - spicy and delicious\nRed blossom roll - yummmm\nSpicy ramen - flavorful and warming\nRyan King appetizer - unique and fantastic\n\nI think I could eat all of these things every single day. We haven't tried anything we dislike and have been here about 4 times so far, 3 of which were all in one week. Haha. We love our sushi. \n\nI can't wait to visit many more times until I've had everything on the menu!",
      "author": "Kristin F."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-06-09",
      "description": "I haven't been to a sit down sushi restaurant in quite some time where there is no sushi belt/conveyer so on Friday night dinner at 6pm, I decided to stop in. I was greeted and seated right away and asked for my drink order a few minutes later. When seated in front of the sushi chefs and looking around me I noticed there were about 15 people and 4-5 sushi chefs at at least 3 servers who were also the hostesses. \n\nWith my water, service of edamame was given which was a nice touch and the server even said where it was placed directionally (to my right) . I ordered the sushi combo C for 17.95 which includes 11 pieces of nigiri sushi and 6 pc spicy tuna roll. This combo comes with miso soup as well. Within about 10 minutes of ordering, my meal was served. I was wondering where the ginger amd wasabi was as I only saw the soy sauce out, but the sushi chef gives it to you with your food. The sushi combo was beautifully plated on a long wooden fish shaped dish too. The first taste I had was sesame oil and wasn't sure if it was the sauce to one of my sushi pieces that was added as a finishing touch or if I mistook the soy sauce for sesame oil. That sesame oil taste did not linger and only happened for the first couple pieces.\n\nI also did an add on order of mixed tempura for 7.50 as it came out with 9 pieces (Two shrimp, two carrots, zucchini, jalapeno without seeds, red bell pepper, onion ring, and broccoli). It was super hot and crisp but after a while you can see and taste how thick the batter is which made it a little too heavy for me. I ended taking the rest home. \n\nOverall, a restaurant that has fast service and a friendly staff! Dishes were cleared very fast and the servers were always polite! Some things to note is that I arrived before the dinner ruash but by 6:30 there was a line to wait and people asking how line would be. I also didn't see any hooks below the counter for purses if you're seated at the counter. Also, it was great to see a lot of chefs as service was fast but did notice plating depended on which chef made your order too as my order was a little different than my neighbors as we ended up ordering the same thing.",
      "author": "Jina H."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-05-18",
      "description": "Best sushi around! \n\nI'll start off with the two things I dislike about it:\n\n1. I feel like a few of the rolls have too much rice on them. Especially the ones that come with the Sushi Combos. I just prefer a little less rice because I think it can mask the flavor of the fish if there is too much, but a perfect amount will simply complement it.\n\n2. It is a bit expensive. A couple of rolls will put you back $25 or more. But I'll say two things in defense of this. The first is that the rolls are big. So I don't feel like I am being ripped off for what I am paying. Second, it is my opinion in Sushi you get what you pay for. So if it is too cheap you give up quality (and when someone is serving me raw fish I want quality).\n\nThose are literally the only two things I can say about this place that aren't great. The service is awesome. The place is small but cool. The options are plenty. I love the eel here, best eel ever. The 503 roll is amazing. A little spicy, and as someone who doesn't love spice I was originally worried about trying it, but it is great. There are tons of good options here. Have been here so many times and never left disappointed. Will definitely be back again, and hopefully soon!",
      "author": "Max W."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-09-30",
      "description": "This place was WOW. SO much food when you ordered rolls, it wasn't great, it wasn't nice inside...I really couldn't wait to leave. It was absolutely PACKED when we went, hotter than all getout INSIDE and super uncomfortable. I will never go back as the food was mediocre at best and fell far short of my expectations based on the reviews.",
      "author": "Martina C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-02-16",
      "description": "I'm writing this specifically to tell you to ignore Handel's review. Just cuz the menu says you can modify, doesn't mean it's free to do so. You sound like you are just being whiny.\n\nThis place is amazing. My wife and I have been to sushi all over Portland and this place is the best combination of consistent, delicious, and not overly expensive. FAVORITE SUSHI IN PORTLAND!\n\nDon't listen to Handel.",
      "author": "Blayne P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-02-10",
      "description": "**FOOD REVIEW ONLY**\n\nCall me crazy for eating at Crazy Sushi! We ordered 2 orders of Tonkatsu ramen, SNS roll, eel katsu roll, crunch lobster roll and 1 other one that I can't recall (too full).\n\nThe tonkatsu ramen was rich, full of flavor and one of the better ones offered at a sushi bar. All the rolls were good except the crunch lobster roll just okay. I'm not even sure if there is lobster evidence. It's hard to tell after all it's deep fried.\n\nThe rolls that we did enjoy was packed with exploding flavors to sweet, spicy,  savory and salty. The 4 S's of food. Every sushi roll was made fresh, made well and mostly made with love.\n\nI will be \"rolling\" again soon for more sushi rolls but this time no ramen since it does take up space.\n\nP.S. We didn't realize the portions were huge until everything was in our faces. To go boxes came in handy.",
      "author": "Joyce L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-04-02",
      "description": "You wouldn't expect to find such a quality sushi restaurant in a strip mall in Sherwood, but Crazy Sushi is it. They consistently have delicious and FRESH sushi. Keyword is fresh. I enjoy their custom creations like \"in and out salmon\" and \"dynamite roll\". \n\nThey are friendly and reasonably priced. If you go during peak hours, expect to wait for a table. Even a to-go order could take 30mins.",
      "author": "Diana P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-22",
      "description": "Sushi here was very delicious and fresh, big portions, excellent presentation, they also have a good beer and sake combo special, recommend for true sushi lovers",
      "author": "Alan G."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-20",
      "description": "I forgot to take pictures of what we got but everything was really good. We got two orders of the California Roll, the Sashimi Regular (which has amazing tuna and salmon), the Udon and the Washington Roll. The sushi rice was really fresh and still a little warm (delicious). Good spot!",
      "author": "Meagan T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-01-12",
      "description": "Absolutely top notch sushi, and likely the best website I have ever see for a sushi place. Their sushi has always been fresh and tasty. The staff is polite and helpful if you have questions. The walls are covered in pictures of people celebrating at the place. It has a very nice feel, like you just wandered in to the best mom and pop shop, and now you are family. There is not a lot of seating, and I have had to wait before, but it's worth the wait. I will be back many times!",
      "author": "Daniel B."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-01-13",
      "description": "OMG. This is Roll City. \n\nWe went here after kayaking and we were hungry. Lucky for us they have monster size rolls. \n\nI'm a sushi eater. I eat sushi three or more times a week. My friend Bill recommends Crazy Sushi. And he is right. The quality of food is top notch, the presentation is good, the quantity of different rolls is good, the service is very good, it just might be that Bill is with us.",
      "author": "Richard H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-07-27",
      "description": "What a delightful, intimate restaurant! \n\nYou know things are going to be good when you show up at 7:30pm on a Thursday night and the place is full - save for a few seats at the sushi bar. \n\nIs this the best sushi I've ever had? No. But, it's really good sushi. Sitting at the sushi bar and watching the masters plate the food was mesmerizing. Great art form.\n\nWe had Monkey Balls (yes, that's a real dish name) - mushrooms and tuna deep fried. The sauce was very good. We also had heart attack roll (also deep fried) and a salmon trio (sockeye, Coho, and King belly) and a 'naked sushi trio' (snapper, grouper, and ahi tuna). All with real wasabi. Big pieces of sushi. Outstanding.\n\nWe were fortunate to be there while a fellow restaurant guest celebrated their birthday. Unlike anything I've seen before. Just go and tell them it's your birthday so you can enjoy the spectacle. \n\nA great little gem in Sherwood. Enjoy!",
      "author": "Anne E."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-12-19",
      "description": "Great sushi!\n\nThey have a huge selection of specialty rolls and a nice variety of salads, noodle dishes, and ramen too. \n\nLunch is the best time to visit, as they have a great menu of bento boxes, entrees, and ramen at great prices. \n\nFriendly and efficient service.",
      "author": "Jessie P."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-02-16",
      "description": "Their menu is not honest. Very poor service and accommodations for someone who does not want rice - or shellfish - but still wants sashimi! The menu says \"can be modified\", this of course, is a complete lie and misrepresentation, as once I asked for modifications, they ask you to change your order. Then, if you insist, they can do modifications with a surcharge (i.e removing 2 items and adding 1 item is still $2 extra). Overall very dishonest menu and not accommodating service.\n\nAlso, very expensive prices. You would be better to buy some raw fish at uajimaya and have a great time at home.",
      "author": "Handel H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-10-29",
      "description": "Really like this place- fast service, friendly staff, delicious sushi! We came in right at open on a Saturday night as we had a movie to catch and the place filled up pretty quickly! Bento portions looked huge, but we stuck with sushi. Everything came out quick- probably my one criticism is the nigiri looked a little ragged, but it was a big portion. We'll definitely be back and I'm excited to take my time next time.",
      "author": "Alyssa J."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-05-19",
      "description": "I think I've been here at least six times now and I love it more and more each time. In fact, I love it so much that I wrote this song. \"Tuna on fire, you're my hearts desire and I only want to be with you!\" \nOK, I guess that's a little weird....\nAnyhow, the food here is amazing and the staff always very, very friendly!",
      "author": "J T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-07-19",
      "description": "The best sushi I've ever had. Very fast and friendly service! It was packed and they had just opened at 11:30",
      "author": "Taylor P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-20",
      "description": "Phenomenal quality and service. Warm and inviting atmosphere. You will not be disappointed.  Favorite sushi spot around.",
      "author": "Angela M."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-08-07",
      "description": "Ordered to go a California roll and shrimp tempura roll\nStaff was very friendly when I walked in\nPleasantly surprised when I got home and saw how decently sized the rolls were",
      "author": "Camila C."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-01-27",
      "description": "Huge portions and extremely friendly service. I would say this is a great go to neighborhood sushi spot. The pictures speak for themselves",
      "author": "Julie T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-30",
      "description": "Second time here and it did not disappoint. Everyone loved their food and the service was fantastic!",
      "author": "Michelle B."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-10-01",
      "description": "Crazy sushi is my fav restaurant! Best quality food and friendly servers. I highly recommend to get sushi combo C and monkey brain fro appetizer you will not disappointed:-)",
      "author": "Sophia N."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-06-06",
      "description": "My absolute favorite Japanese place! Great service and good portion sizes. I always get the teriyaki salmon and it is cooked to",
      "author": "Tawny R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-03-04",
      "description": "Crazy Sushi is crazy good. People don't believe me when I say this is the best sushi place around, that is until they see it and taste it for themselves. \n\nStaff are so friendly and welcoming. The food is fresh and fairly priced. Good drinks too!\n\nWarning: you'll probably get excited, order too much food, and feel very full and happy afterwards.",
      "author": "Danielle V."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-02-14",
      "description": "Definitely glad that I could trust the Yelp reviews I read about this neat little place!\n\nWe went during lunch on a Saturday and although it was nearly full, we were brought to our seat right away. This is a small place to dine, yet thankfully there is no shortage of staff to help out.\n\nOur order was taken promptly and the food was brought out in good time. It all looked so beautiful!\n\nWe started with the Miso soup and Seaweed salad, both of those items are very common so thankfully they lived up to if not beyond expectations.\n\nAll of the sushi rolls were excellent.\n\nI often get nigiri if I am getting quality sushi, because it's more of just the fish taste. So I got the tobiko (flying fish egg). Hands down was the most stunning presentation of that I've ever seen. Black, orange, and even green tobiko! I had no idea green tobiko was even a thing until now. And although that doesn't really make a difference on the taste, it just showed that they truly care about how their food is rated all around. I also had the tako (octopus) nigiri and I definitely think that was the best time I've ever had that too.\n\n\nONE thing that I will warn you about... Their soy sauce seems to be way too salty, to the point where it could really hinder your expectations of the sushi. Even trying the 'low sodium' soy sauce seemed too salty so be aware of that.",
      "author": "Matt R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-19",
      "description": "This is a great sushi place for sushi you will not find elsewhere.  The rules are large and the toppings are generous.  Waiters were attentive and nice.  Atmosphere was good, and food was delicious!",
      "author": "Kyla B."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-08-20",
      "description": "Worst bento box ever . Chicken teriyaki was dry, tempura was greasy with no dipping sauce and salad was plain. 13.95..what a ripoff! I hope they improve this as I won't be going back .",
      "author": "Jodie S."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-09-23",
      "description": "Changed ownership a couple years back.  Original owners open Shoten Sushi in Beaverton.  New owners of Crazy sushi not producing same quality or atmosphere.  I live within 6 miles and won't go here.  I would rather drive to Beaverton (Shoten).",
      "author": "DJ M."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-04-26",
      "description": "My first time today dining. What an experience! Top notch service, delicious food! So filling! The muscles are my fav. Bar none, high recommend them.",
      "author": "Janell J."
    }
  ],
  "aggregateRating": {
    "ratingValue": 4.5,
    "reviewCount": 390
  }
}