{
  "telephone": "+15039541270",
  "priceRange": "$11-30",
  "name": "Fish & Rice",
  "address": {
    "addressLocality": "Portland",
    "addressRegion": "OR",
    "streetAddress": "2332 NW Westover Rd",
    "postalCode": "97210",
    "addressCountry": "US"
  },
  "known-for": {
    "Health Score": "97 out of 100",
    "Vegan Options": "Yes",
    "Takes Reservations": "No",
    "Delivery": "No",
    "Take-out": "Yes",
    "Accepts Credit Cards": "Yes",
    "Good For": "Dinner",
    "Parking": "Street",
    "Wheelchair Accessible": "Yes",
    "Good for Kids": "Yes",
    "Good for Groups": "Yes",
    "Attire": "Casual",
    "Ambience": "Casual",
    "Noise Level": "Average",
    "Alcohol": "Beer &amp; Wine Only",
    "Outdoor Seating": "Yes",
    "Wi-Fi": "Free",
    "Has TV": "No",
    "Dogs Allowed": "No"
  },
  "categories": [
    "hawaiian",
    "japanese",
    "salad",
    "soup",
    "sushi-bars",
    "vegan",
    "vegetarian"
  ],
  "review": [
    {
      "reviewRating": 5,
      "datePublished": "2019-12-04",
      "description": "\"I think this might be the best sushi in Portland,\" I said to my fiance after a late lunch here one afternoon. Because WOW. This place is hard to beat. Not only does it have delicious food, but it also has DELICIOUS WINE AND BEER. So often a great sushi place has limited selection in this area. Not Fish & Rice! Fantastic selection all around.\n\nAlso the decor is ADORABLE. Lovely little well-lit spot with cute plants, dog pictures, and more! \n\nCan't recommend this place enough. If you haven't eaten here yet, may I suggest you go IMMEDIATELY.",
      "author": "Alyssa C."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-10-13",
      "description": "Pretty good sushi for what it is. Decently priced means decent sushi. The sashimi was okay, not the freshest in my opinion. The uni today just came in so it was bomb.\n\nThe sushi rolls were mostly rice but still good! The salmon bowl was yummy! \n\nAll in all, a good dinner and a beautiful hipster spot. Staff was friendly, service was quick.\n\nFish and rice and most things nice",
      "author": "Jennifer C."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-09-25",
      "description": "well, let me start off by saying I am so happy to have found a sushi place less than a five minute walk from my apartment that is not only serving great sushi for affordable prices, but it's possibly the cutest sushi restaurant in all of portland! shiba inu artwork, so many plants, minimalist interiors with light wood tables & simple decor all around. i just love it.\n\nstopped in on a tuesday around 8pm after watching the Vaux Swifts. you order at the the counter then get a number, which is different than my usual sushi spots but i didn't mind. there were about 5 people in front of us, the line went quick though.\n\nwe got the house sake, seaweed salad, philly roll, crunchy shrimp & their salmon roll that had red peppers in it. can't remember the name right now. \n\nthe sake was great for being their house sake. $7 for a large is a fair price too. i'm a snob about seaweed salad and theirs was exceptionally good. my favorite seaweed salad comes from Maru off Division and this was up there with theirs.\n\nthe sushi was simple, delicious and fresh. not too much cream cheese in the philly roll which i prefer, i hate when they overdo it. the other two were really good too, loved the crunchy shrimp. no complaints whatsoever.\n\noverall, i'll definitely be back. this place is so cute with quick service & they have shiba inu portraits as their artwork. does it get better than that??? also super affordable. already looking forward to my next visit, i'm thinking i'll try their poke bowls next time. not a place to be passed up if you're looking for great, unpretentious sushi in the cutest setting.",
      "author": "Brittany J."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-12-16",
      "description": "The best sushi we've found so far in Portland. My family and I moved here from CA over the summer and one of the things we miss the most is good sushi.  I think our search is over.  This place is adorable, cute interior and vibe. They have a great menu.  My husband and I decided to do the omakase for two. The chefs did not disappoint.  We had nigiri, sashimi and two rolls for $70.  Everything was delicious and I've included pics of most of our meal.  Each dish was bursting with flavors, no soy sauce or wasabi needed.  The staff was also very sweet to our 18 month old.  He was getting antsy and they sent him out an adorable carved orange to eat that looked like Mickey Mouse as well as a bowl of avocado. Crisis averted!   We'll definitely be back, hopefully often.  Our server Derrick was great!  The only thing we didn't like was the house sake, but they did have other kinds to choose from.",
      "author": "Nicki I."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-09",
      "description": "My Hubs and I ate here on the 4th of July. We were vacationing in Portland and had just strolled through Washington Park and arrived at Fish & Rice for a late lunch. It's a super cute, minimalist place. I liked the decor and vibe right off. \n\nWe ordered the Tofu Bowl for $10 and the Omakase--chef's choice-- for $35. Both were spot on delicious. We were especially impressed with the chef's special roll that included fresh crab, shiso, and lots of other tasty ingredients that escape me right now. Our chef was young, he looked straight out of college, but his youthful look belied his excellent sushi skills.\n\nCouldn't have asked for a better lunch on Independence Day! Next time we're in Portland, we're definitely coming back to Fish & Rice.",
      "author": "Peg C."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-09-03",
      "description": "Fish and rice is cute. It is definitely Instagram-able. The shiba inu portraits hanging on the wall make you feel like you're in a cute neighborhood cafe in Japan. You grab a menu when you walk in and line up at the register to order. They have a range of poke bowls and sushi rolls to pick from, along with a small assortment of side dishes. We each got a poke bowl - I opted for the scallop one with the spicy mayo on the side, while my partner got the salmon bowl but substituted albacore for the salmon.\n\nThe fish was pretty fresh - the scallop actually ended up being the larger kind used for nigiri and sashimi, sliced into smaller pieces. I was happy since I was expecting the smaller bay scallops. I didn't like the spicy mayo sauce though so I was glad I got it on the side. My partner's bowl barely had any traditional poke sauce on it - we both just ended up using soy sauce at the tables. \n\nWhile the food was alright - definitely better than some poke places - I probably won't be back. We both still much prefer Quickfish for poke bowls for the quality of the fish, the different sauces they have and how you can customize your bowls. This place would be okay for lingering a while in a group and getting drinks since they have some space but I wasn't super impressed. It was also annoying that they didn't have paper menus to read for the drinks. You had to go up to the counter to read off a sheet of paper with small print to find out what they had. Overall, I like what they're trying to do and the ambiance but I thought the poke fell a bit flat. 3.5/5 for me.",
      "author": "Katie B."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-12-14",
      "description": "The food is very fresh at Fish & Rice. We had 3 special rolls: Neskowin,  Senzu Tuna, and Paper Lantern, plus miso soup, side salad with miso carrot dressing, and chicken dumplings. All were extremely tasty. The staff recommended a cold sake for us and it was delicious also. The staff was friendly and helpful. We will be back!",
      "author": "Paige L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-06-12",
      "description": "I think this is one of the coolest little restaurants in town. The decor is modern, clean, and trendy with cute little details scattered throughout. \n\nI've gotten both nigiri sushi here and the Senzu Tuna roll. They were happy to make the modifications I asked for on the roll. The roll is a decent size and, I think, priced fairly at $13. The fish tastes very fresh. \n\nMy first time here, my order was slow to come out and I was offered a free dessert to make up for it. I turned it down, but the offer was appreciated.  \n\nThis place also has a really unique craft beer selection. I was able to try Prairie Brewing from Oklahoma, which had been on my craft beer wishlist, but I wasn't sure I'd be able to ever find their beer. They also had beers from other popular craft breweries like Mikkeller. \n\nI look forward to frequenting here.",
      "author": "Kate O."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-05-06",
      "description": "This trendy spot, located just outside of downtown PDX, was the perfect place to cure my poke craving on a recent visit to the city. I ordered a tuna poke bowl, some miso soup, and - of course - my fave: hamachi nigiri. All of the food was phenomenal and fresh. I did find the addition of raw kale to my poke bowl to be unnecessary. While it was a pretty touch of green, I've never seen kale in a poke bowl and it wasn't my favorite thing about this meal.\n\nThe restaurant itself is bright and full of natural light. Ordering is done at the counter and you then find a seat, where you can watch the sushi chefs working their magic in the open kitchen area. You can also order beer, sake, or wine to enjoy with your meal. The ordering process was a little confusing at first, but the food did arrive quickly. Best bite of the day: that amazing hamachi!",
      "author": "Jennifer J."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-11-29",
      "description": "Simple and clean interior. First time at this place I had the salmon poke bowl. I really liked the sauce for the poke that they used. You can substitute for king salmon for an extra $2. I think better off with the regular salmon. I would definitely come again.",
      "author": "Jordan K."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-09-18",
      "description": "The food here was good and fresh. There's plenty of options to choose from. The dishes look simple but yet very intricate and beautifully put together. I ordered from their lunch special since I wasn't particularly hungry. It comes with 2 simple rolls, salad and miso soup. The rolls we ordered were simple and delicious. The thing I looooved was the mochi ice cream. The strawberry flavor was good and not overwhelming, which was perfectly complimented by the soft mochi.",
      "author": "Maria V."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-12-07",
      "description": "Friendly, helpful service from everyone. The food was unique and outstanding! All the fish was incredibly fresh and tasty.",
      "author": "Kirk L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-01-10",
      "description": "Top 3 sushi places in Portland. \n\nThe fish here is always good and fresh, probably impossible to find anything better than this near the price point in Portland. \n\nThey have a giant menu which offers something for everyone, and their specials are always phenomenal. \n\nI've had a thing or two I wasn't a fan of, but the good things totally outweigh it. I'm not a huge fan of rolls, but this place does a really good job. (Namely the surf and turf special)\n\nBut if you do make your way here, you should most definitely order some nigiri. The salmon and yellowtail here is butter, and the ceviche nachos are a perfect beginning to your meal.",
      "author": "Seiji N."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-10-19",
      "description": "Stoped in here yesterday because I was craving a poke bowl. I ordered the spicy salmon bowl to go. I asked for radishes to be added to my bowl and the kid taking it said it would be an extra .50 cents- fine. I was disappointed when opening my bowl to discover maybe a 1/4 cup of rice with minimal toppings. They also put a lot of the firecracker sauce on top and my rice was swimming in it. If you're going to charge people 12.50 for a poke bowl, make sure it's enough food to make them feel full. Their saving grace was the salmon sushi was delicious. Definitely overpriced for what I got and I will not plan to go here again.",
      "author": "LJ P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-12",
      "description": "Ordered the tiger roll, uni, tuna poke bowl, and house sake. Everything was delicious.. Especially impressed with the flavors in the poke bowl. I will def be back to try more",
      "author": "Shauna F."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-06-02",
      "description": "One of the freshest Japanese meals I've had. I got the salmon bowl ($12). The portion size looked smaller than what I'm used to paying (not bad but I wouldn't come here if I was really hungry or I'd get 2 dishes). But the ingredients were so fresh and there was a fair amount of salmon too. Firecracker sauce was really good on the dish and the onions and cucumber complemented the soft and tenderness of the fish and rice very well. \n\nCustomer service was nice and friendly. Very clean and nice interior design with lots of light colored wood and white and plants. Plenty of seating from big tables to couples tables to counter space plus outdoor seating.",
      "author": "Amy N."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-09-10",
      "description": "Super impressive!! Veggie dumplings were probably the best I've ever had. Truffle edamame also amazing. Great selection of sushi and poke, also vegetarian options!!",
      "author": "Olivia G."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-09-16",
      "description": "Amazing delicious lunch place. \n\nDifferentiating factors: clean, chill ambiance, great music- Maggie May, American Pie? Yes! \n\nLunch: two roll special was great and comes with amazing soup and salad. The salad dressing looks and tastes homemade.\n\nSalmon bowl: delicious generous portions. Spicy mayo sauce is unique and on the slightly spicier side and I thoroughly enjoyed it. A very clean crisp meal. \n\nTea: Genmai tea is great and comes in a tea presser good for two to four. \n\n\nMocha ice cream: yummy comes with whipped cream and blueberries. \n\nService: great. Order at counter. But they treat you so well. \n\nBathroom: super clean. Loved it. Kitchen must be clean too!\n\nComing back!",
      "author": "Young Y."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-08-26",
      "description": "The name implies they're going for minimalism, but the decor screams busy and cluttered.  The video monitor in the middle of the dining room is odd.  There's so much potential, especially for a Japanese themed venue.\n \nMy favorite part of our visit was the Boylan Heritage Ginger soda, one of the better I've had.\n\nEel Avocado Simple Roll - rice tasted fresh, pieces were on the small side, eel was okay.\n\nSalmon Tartar - clever, includes a quail egg like beef tartar, maybe add more of the Trader Joe's style taro chips.\n\nSalmon Bowl\nLike the tartar, the salmon tasted fresh.  The dish is a bit rice heavy; the place is not about value.\n\nSake\nMeh.\n\nAs a customer I appreciate six employees in a near-empty restaurant.  As a business person, I wonder how long this can be sustained.  \n\nService was efficient and friendly. \n\nSome cute odds and ends in the place, but one and done for me.",
      "author": "Andrew A."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-04-23",
      "description": "Dare I say this rivals Bamboo? GASP. \n\nBeautiful light, minimal and bright location. Mellow tunes, and an aesthetically pleasing beer display. Tons of interesting roll options, nigiri, poke and more! I tried the kauai roll, the king salmon, tuna and scallop nigiri. Service was great, expedient and friendly. My only gripe was the wait time on rolls, but they were so worth it! Absolutely breathtaking presentation and the king salmon especially was incredible! Fish quality matches bamboo in my book, and that's hard to do. I cant recommend this place enough!",
      "author": "Devin V."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-09-17",
      "description": "With a clean and modern interior, Fish & Rice serves sushi and poke, as their name so aptly describes. Order at the counter and then seat yourself!\n\nI got the Yellowtail Sashimi ($6) and Salmon Bowl ($12). The sashimi was delicious, definitely tasted very fresh and good quality. The poke bowl was solid, but the bell pepper in it didn't do much, and I wished the sauce had more flavor -- it just had a slight kick and that was it. And portion could've been larger. I did appreciate the avocado and the rice, which was the perfect texture. Overall, I'd come back if I was nearby!",
      "author": "Anthony T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-08-15",
      "description": "Atmosphere: 5/5 \nSpacious, modern, and clean. With Nintendo for guests to play, which is a plus ;) \n\nCustomer service: 5/5\nSuper friendly, great and fast service. Explained options and what's available in detail for us, which was nice.\n\nFood: 5/5\nGood quality fish. Home made sauces. Meat and veggie dumpling was delicious! Good quantity and price matches quality. \n\nWorth checking out. We will be back with our friends who are more of sushi lovers than us :) we were very satisfied.",
      "author": "Cera O."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-07-25",
      "description": "Talk about being intentional--this place does it!\n\nI LOVE fish, so I had to check this place out. Let's start with the ambiance--the restaurant is tucked away off 23rd place, so you wouldn't see it if you were just walking along 23rd Ave. The decor is cute, clean, and feels like you're hanging out in the living room of a home pulled out of a design catalog. I love the natural light, the plants scattered about (I think we counted at least 25 of them), and the doggie decor. Yes, dog lovers, this is the place for you. You will find a stool with a corgi butt on it, and you won't be upset about it in the slightest.\n\nLet's get onto the service--when we walked in, the woman who took our order gave us the full rundown on the different areas of the menu--and there are A LOT of options! I wanted to try the sushi, but we decided to get poke. We thought it would be fun to try some Japanese whiskey since we're both whiskey fans, and she made a great recommendation. I want to come back and buy some bottles that they have on the shelf--their recommendations are solid. \n\nWe started our meal off with edamame, which was a great little appetizer. Then we had our poke bowls--they were so good! I'll be honest--I don't remember ordering cucumber in my bowl, but it was everything I didn't know I needed. The portions weren't huge, but it was just right so that we didn't have any leftovers. We ended our meal with the matcha creme brûlée, and dear lord--it was magnificent. I've never had matcha before, but this dessert was on point. \n\nThere were so many great looking menu options that I MUST come back! I hope to again soon before it gets busy!",
      "author": "Ophelia Y."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-05-02",
      "description": "Solid poke bowls and decent sushi rolls, but not as good as Quickfish/Bamboo. I've had the tuna and albacore poke bowls and would recommend both. For the rolls, I ordered the Eel Avocado, Philly, Cosmopolitan, and Senzu Tuna. All 4 were decent, but I had an issue with the amount of mayonnaise on the Cosmopolitan. The Senzu Tuna also had mayo on it. WHO DECIDED MAYO BELONGS ON SUSHI? STOP IT!!! Oh the Caucasity! \n\nI think I'll skip the rolls in the future. I'll be back to try their nigiri. Hopefully there's no mayo on it.",
      "author": "Travis T."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-03-11",
      "description": "Love the name, love the concept - it's a clean, cute, bright place to get good poke bowls. Great location near the heart of the NW shopping district. The counter ordering is great - this somehow makes everything feel more efficient. They have the OG Super Mario(!!) game + controllers on a TV near the ordering area (we didn't take advantage of this as much as we should have). \n\nLots of sushi + poke selections, and a good/unique beer and wine selection. Love that you can get your poke bowl with brown rice ($1 upcharge) and it's only $13 for a filling salmon bowl. A very solid vegetarian menu, too, for those who don't eat fish - not just limited to bland cucumber roll stuff here. \n\nI also tried the Paper Lantern sushi roll and it was just okay - a little flavorless after the great poke bowl, which was disappointing from the description - but would be willing to give their other sushi rolls a try.\n\nReasonable pricing, fast service, good poke with a lot of flavor. We will be back!",
      "author": "Courtney R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-07-12",
      "description": "Love this new sushi spot! \n\nLocation is in the hot and popping NW Portland location. \n\nThey serve the usual nigiri, sashimi, and also have special rolls and poke bowls!!! Definitely ask for their specials and check out their dessert. Currently they have mocha and matcha crepe brûlée. BOMBBBBB\n\nI ordered a glass of wine on top of my meal and it set me in a mood. Love it and the aesthetics here, very Instagram-able.\n\nThey also have this cute tv section with games!! Hello street fighter! \n\nCome and visit!!!",
      "author": "Jenelle B."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-08-15",
      "description": "Beautiful spot and very open. The staff was super kind and very hip. I got a poke bowl to go and I have to say for the cost of it I was a little disappointed. Smaller portion than any other poke spot in town, very skimpy on the rice. That being said it did taste good! Big menu, plenty of options. Wouldn't be jumping to go back but it is a spot I would give another shot.",
      "author": "Molly M."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-08-31",
      "description": "The cutest place ever. Found it by accident but the whole atmosphere and style of this place is incredible. I wanted to sit there for hours. Filled with many amazing plants, the staff is super nice and friendly, VERY great food. Soooo coming back here ;)",
      "author": "Viky P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-04-28",
      "description": "Very fresh sushi...  my daughter loved the\nmisubi and their fresh watermelon smoothie.   The tuna poke melts in your mouth.   The dressing to the salad was so tasty...\nStaff are very receptive and kind.  Very good selections in the menu and not overwhelming.\nAtmosphere in restaurant is delightful.",
      "author": "Odette O."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-02-23",
      "description": "From my first visit, I have been continually impressed by the fresh seafood and large selection of alcohol. Fish & Rice has a very casual and comfortable vibe. Their staff is welcoming, knowledgeable, and accommodating. \n\nI recently found Fish & Rice on Instagram and learned about their Valentine's tasting menu ($100 for two people and included 4 sake pairings). Upon sitting down, we were served a warm bowl of miso soup. The kusshi oysters were delicious and flown in overnight from British Columbia. The Chef's choice for the sashimi showcased fresh fishes. Each sake pairing was thoroughly explained. The Chef's sushi roll was my favorite part of the meal! Chef perfectly balanced the creamy avocado and crispy sweet potato chips without taking anything away from the tuna. I wish there was a way to order this roll again! Lastly, the dessert was a sweet sake paired with local wild flower honey and Jacobsen Salt Co. creme brûlée. While I was sad that there was only one creme brûlée to share (I definitely wanted to attempt to eat one all by myself), the portion ended up being just perfect. \n\nDear Fish & Rice,\n\nPlease have more of these special menu/tasting events! Thank you for your consideration. :)",
      "author": "Tracy W."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-07-27",
      "description": "After venturing the city in 97 degree weather, I made it to Fish & Rice around 2:30pm. I've been seeing good reviews and wanting to try this place for a while. The shop is really cute and the staff are friendly.\n\nSo why 3 stars? It's more 2.5 stars really... I ordered the lunch special, which comes with soup and salad. The guy next to me had gotten his salad from the very begging, while I waited patiently + moving the leftover dishes, napkins and beverages from the previous customers aside the table. After I was 1/2 way thru my sushi rolls, I mentioned I still had not received them. The waitress acknowledged it, and they were finally brought to me. I didn't get an apology nor any freebie for the inconvenience. Not saying I REALLY wanted it, but it'd made me feel they cared.\n\nFood wise... The sushi was enjoyable, but my rolls kinda sticked to each other. When I separated them, some got unraveled. I can kinda taste the favor of the fish (avocado eel roll) , and kinda get the crunchiness of the shrimp (crunch shrimp roll). \n\nSushi has always been my comfort food, and I was hoping this would be my new fav shop since it's in my neighborhood. Again, the shop's is adorable and the staffs are friendly. It's a local business and please do visit/check it out!   However, with the average sushi experience and left over customer service in my experience. I will favor other sushi shops in town.",
      "author": "Yuli L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-06-13",
      "description": "By far the best sushi I've had in town & also at the best price point. It's in a perfect location and the ambiance is clean + white full of greenery. There is both indoor and out door seating. Lots of great sake and beer! I loved literally every single I ate, such an easy going relaxed vibe. Couldn't recommend this place more!",
      "author": "Kelsey C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-12-01",
      "description": "This is such a great sushi spot. It's a cute little restaurant in a great part of town. The poke bowl was really good, and the sushi was phenomenal. It's pretty much neck and neck between this restaurant and Bamboo sushi for best sushi on NW 23rd ( I know technically this restaurant isnt on NW 23rd but it's just off it). Would definitely recommend stopping by here if you're in the area and love sushi. These guys know what they're doing and have a great thing going here.",
      "author": "Pat M."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-10-24",
      "description": "this is the BEST sushi I've ever had! the fish is so fresh, aesthetic is super cute/simple and they have a super GREAT lunch special. Go CHECK em out!!!!",
      "author": "Antoinette R."
    },
    {
      "reviewRating": 2,
      "datePublished": "2019-07-24",
      "description": "A OK Hostess/Owner\n\nWent home with a civeche 14-16$.  Seriously there was a enough money to buy a whole rainbow roll. I got salad and dressings. With 2 forks maybe of fish.\n\nI may be spoiled living in SF most my life and finding the best sushi places...but this is a joke for the price. \n\nDONT spend money here.",
      "author": "Jaiden F."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-06-13",
      "description": "This place is incredible. Everything healthy and delicious. The beer selection is also fantastic. Salmon bowl, the cosmo roll, hamachi, and house made spicy mayo is a must. The environment is perfectly relaxed and comfortable. Couldn't recommend more.",
      "author": "Kelly B."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-03-09",
      "description": "I love finding new places to eat at and I'm so glad I found this one while scrolling through Instagram. I went with my friend last week, and we both really enjoyed it, the staff were very nice. I always worry about going to new places. I don't want to jump to conclusions or anything but since I am a minor, older people seem to not care as much for me (at least that's my experience). Not this place though, I felt very relaxed and happy inside the small restaurant. It was small but the long windows, great lighting and minimalistic decorations made it seem bigger than it is.\n\nBoth my friend and I ordered the Salmon bowl, I never had a poke bowl before so I was very excited to try one.\nPlus I love raw salmon! The salmon bowl has many pieces of raw salmon, rice, cucumbers, avocado, green onions, red pepper, edamame, taro chips, sesame seeds and their firecrackers sauce.  I was a bit iffy about the avocado since I don't like the taste of avocado but let me this you this, once I mixed all of those ingredients together, avocado suddenly became delicious. I was shocked, I would've never thought avocado mixed with rice would be that good. You get the point, it was amazing. The firecracker sauce, if you really can't handle spice then ask for a different sauce. I love spicy food, like really spicy anything but I haven't had anything spicy in a while so when I first tasted the sauce it made my tongue jump out of my mouth. \n\nMy only criticism would be the plate the food was served on, it was a nicely made plate, but every time my spoon slid against it, it made a very loud sound. \nAll in all the whole vibe of the place and the food combined just made me love the place even more. \n\nTotal price: $12\n\nI will return for more.",
      "author": "Christina D."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-09-20",
      "description": "The name is simple, the taste is anything but. I have had my share of fish, especially poke and I must say this place is sooooooooooooooooooooooooooooooooo\nSo\nSo\nSo good. I had the albacore tuna poke bowl-subbed the Wakame for avocado-with green goddess dressing, onions, radish, fresh mangos,sprouts,  edamame, and rice. The fish was insanely fresh, melt in my mouth fresh. Full of flavor and a generous size. The staff was knowledgeable and friendly. I've already told everyone I've seen today about this place bc it was THAT GOOD! Stoked to find this gem. Check it out you won't be disappointed, for real. \nSide note: the Rosė they offer is some of the best I've tasted with a generous pour. \nI'd deff come back again- and will continue to recommend",
      "author": "F C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-07-13",
      "description": "The ambiance and decor of the restaurant was extremely cute. My friend and I were in Portland for the first time and it fulfilled our expectations. The food was good too, the portions were just enough. We ordered 3 rolls for the 2 of us. The frosé (frozen rose) was interesting but ended up tasting really good. I would come back here if I'm ever back in Portland!",
      "author": "Nacinda P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-10-06",
      "description": "Went in for the 4-people omakase today and we were not disappointed!! The first plate came out with lots of different sashimis, and from conventional omakase platings where they bring out only 1 dish at a time, we thought they combined all the dishes in the omakase into one because this first plate had 5 different sashimis with 4 pieces each. For $25 each, we thought that was a fair portion so after finishing up, we stood up and started heading for the door and saying goodbye to the owner when he told us to wait because a lot more food was coming  \n\nThe next 2 courses were sushi and boy were the sauces amazing. I normally am just into traditional quality sashimi cuts, but both times at Fish & Rice I have been thoroughly impressed in how they craft unique complex dressings and sauces that finely complement the fish. \n\nThe only thing about the experience that was off was the lack of communication about what the omakase entails. After the premature attempt to leave, we were always unsure whether the next course was the end. After they took our last dish away, we didn't get get any desserts or even a goodbye or \"hope you enjoyed the meal\", nor did they even take all our platings on the table away to signal us it was the end. Regardless the meals here have been nothing short of enjoyable and completely worth the prices, so I would recommend it to anyone craving anything from poke bowls, some simple sushi rolls, or omakase!",
      "author": "Van N."
    }
  ],
  "aggregateRating": {
    "ratingValue": 4.5,
    "reviewCount": 151
  }
}