{
  "telephone": "+15037752019",
  "priceRange": "$11-30",
  "name": "Fujiyama Sushi Bar & Grill",
  "address": {
    "addressLocality": "Portland",
    "addressRegion": "OR",
    "streetAddress": "4124 SE 82nd Ave\nSte 550",
    "postalCode": "97266",
    "addressCountry": "US"
  },
  "known-for": {
    "Health Score": "100 out of 100",
    "Takes Reservations": "Yes",
    "Delivery": "Yes",
    "Take-out": "Yes",
    "Accepts Credit Cards": "Yes",
    "Good For": "Lunch, Dinner",
    "Parking": "Private Lot",
    "Bike Parking": "Yes",
    "Good for Kids": "Yes",
    "Good for Groups": "Yes",
    "Attire": "Casual",
    "Ambience": "Trendy, Classy",
    "Noise Level": "Average",
    "Alcohol": "Full Bar",
    "Good For Happy Hour": "Yes",
    "Outdoor Seating": "No",
    "Wi-Fi": "Free",
    "Has TV": "Yes",
    "Caters": "Yes"
  },
  "categories": [
    "japanese",
    "wraps"
  ],
  "review": [
    {
      "reviewRating": 5,
      "datePublished": "2019-08-14",
      "description": "This is my favorite place for sushi .  \nThey make it all, if it's not rotating on the track, they will make it.  Regular prices are reasonable but happy hour is the best.  \nFavorite roll to order is called The Manhattan.  Getting hungry just writing this review.",
      "author": "Melissa K."
    },
    {
      "reviewRating": 2,
      "datePublished": "2019-10-06",
      "description": "Wow... this place has really fallen far.\n\nNot even 3 years ago you could come here on a weekend and it would be PACKED. They had a consistent group of servers and cooks who kicked ass and were so friendly and on the ball. \n\nThe last two times I've visited have been sub-par and this time was unfortunately really disappointing. They had 2 servers who could've cared less about the clientele. People were literally getting up to ask for drinks, wasabi, etc. Which is ridiculous because this place is small... the servers don't have that big of a space to watch over. I think they just honestly didn't really care. \n\nThe variety of plates was almost non existent. Fruit and mussels were abundant but there wasn't even a Cali roll on the belt. My fiancé asked for 2 plates and when we got them (freshly made) he said they tasted old and not good. \n\nThe only reason I still give this place a chance is for the calamari which is amazing. It's crisp, not chewy and the spices are something I've never had anywhere else. \n\nI am so sad this place is no longer the amazing sushi spot it once was. I'll deeply miss it.",
      "author": "Shelby J."
    },
    {
      "reviewRating": 2,
      "datePublished": "2019-08-03",
      "description": "the food didn't taste bad but it was hard to eat because the second thing i ordered had bones all throughout the unagi, neither my boyfriend or i have ever gotten bones at a sushi bar before this, and they accidentally charged us more than we signed for and we had to call to dispute and get it fixed, the service was really good otherwise and they were really nice about soliving the problem as soon as they could about our bill, usually i prefer sushi Akira and give it full stars, but if you're willing to pay as much as this resturaunt do yourself a favor and check out Kyoto sushi its high end and runs the same pricing as this conveyor belt sushi lounge. kyoto so far is my #1 if you can afford full rolls you'll never regret. \n\ncould be a new chef problem we also paid part cash and part card so i told the man on the phone i understand why that thing sometimes goes wrong, our manager has to solve problems like this all the time at my job where the computer accidentally charges the full amount to the card after they paid cash, its fixable and they did it",
      "author": "Julien A."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-08-02",
      "description": "I've ordered three times, first two times five stars all the way. I just got my order, No wasabi, No pickled ginger, and the entire meal stunk of old fish, worst sushi experience of my life. I thought Sushi smelled of the sea... The most awesome spicy tuna hand roll the first times ordering this time smelled awful and I couldn't bite through the rubber that was supposedly seaweed. Thoroughly disappointed, especially after recommending it to countless friends..\n\nAnd now I feel sick, never again!!!",
      "author": "Jeff R."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-10-19",
      "description": "Walked in, sat down, nothing looked particularly super appetizing and the other patrons were smoking indoors- so not appealing. Ended up leaving after we sat down. Can't wrap my head around wanting to eat around the smell of cigarettes.\n\nWe're non smokers. Sooo yeah.",
      "author": "Nat P."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-10-22",
      "description": "Pretty disappointed with my experience here last week. My partner and I were in the area doing errands and decided to get a few plates because we were hungry. I remember eating here years ago when they first opened and it was good.\n\nNeither or us were impressed with the selection on the belt. It had lack of diversity and freshness for 6:30 on a weekday. The service was sufficient-but nothing actually kind or caring. I ordered their veggie tempura roll. I appreciate that it was made fresh, however they rolled up the steaming veggies instantly out of the fryer, which made the batter soggy and there wasn't a sauce drizzle on it like every other place does. Overall it was rather bland.\n\nBummed we wasted $30 on a mediocre dinner...but that ish happens when ya don't read reviews first.",
      "author": "Raw F."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-05-02",
      "description": "I came here for a late lunch. The rolls tasted great, though the fish was what you'd typically expect from a casual sushi joint in east Portland. \nUnfortunately, another customer ended up stealing my credit card while I was paying my bill because of the server's negligence. The server left me wondering \"wtf\" for about ten minutes while they were trying to figure out what to do (without letting me even know what happened), and the thief immediately started charging my card. \nThe server told me they would help me file a police report and give me surveillance footage. They comped my small lunch bill (I also didn't have my credit card anymore...), but they never came through with the report or footage.\n\nI'll never come back here- not because of this terrible situation, but because of how clearly they lack basic customer service skills.",
      "author": "Meggyn P."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-08-23",
      "description": "Hands down the best calamari at a sushi restaurant. The breading is coated perfectly, not too little and not too much. And there's some secret ingredient in there that gives it a little sweet kick. HIGHLY RECOMMEND. The small size is good enough for 2 people. \n\nI usually only come here for Happy hour where all sushi plates are $1.95. Sushi happy hour are during Wednesday's till 2pm and all day thursdays.",
      "author": "Mai D."
    },
    {
      "reviewRating": 1,
      "datePublished": "2018-12-29",
      "description": "I'm downgrading this to one star. The owner or mgr reached out to me, which was cool.  Many months had passed and I decided to try this place one more time with the hopes it would be awesome again. Another mistake...wont happen again. \n\nThe girls working were so rude to me, and one was pissed when I got up and BROUGHT her my glass and asked for a refill (I know this because she groaned when she had to stop gossiping with her coworker for a sec) and every plate I got was stale and unappetizing. \nWhen I first got there, I asked for a menu, but she never once came back to take an order. \n\nNope.",
      "author": "Melissa S."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-05-03",
      "description": "Sorry that I have to downgrade Fujiyama. We used to love coming here, but there's been a good bit of price inflation, a definite downgrade in quality and portion size, and also in service.  \n\nIt used to be a fun value, but I'm crossing it off the favorites list.",
      "author": "Dana S."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-11-11",
      "description": "Excellent ! Fresh And Always great customer service !! The rolls are amazing ! Will come back again soon !",
      "author": "Marni S."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-09-30",
      "description": "Oh dear. \n\nRice was mushie and had no flavor; I did not detect any flavors from the vinegar or sugar. Nori took copious amounts of chewing action to break down its rubbery soul.  \n\nThe folks working here are super sweet; seems like an issue of quality ingredients and training. Doubt I'll come back anytime soon to see if there are any improvements. Ick.",
      "author": "May A."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-03-31",
      "description": "I travel for work and am constantly all over the state and west coast. I eat sushi at least once or twice a week. This was probably the worst sushi I've had in an actual restaurant. I'm not exaggerating. One they charged me for wasabi... yes. Wasabi. Then I got here over an hour before they close and they told me they weren't filling the conveyor anymore which is weird to me. But. Ok.. so I ordered some rolls and nigiri. This was easily the worst sushi i think I've ever had. The waitresses never refilled my drink the entire time I was here... Fred Meyers sushi was legitimately better than this. So disappointing.",
      "author": "Nick C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-02-09",
      "description": "Amazing. Definitely my favorite sushi place in Portland!!! I have a friend visiting from out of town and this was the first place we had to stop. Sushi is good and the people are so friendly",
      "author": "Ceara M."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-02-04",
      "description": "I work in the food industry and never in my life have I had such poorly attentive customer service. From the moment I walked in, I had to be the one to greet the server. I was never offered any wasabi or ginger, so I had to help myself from the back counter. My water sat empty on the table my entire meal. They did not honor their happy hour prices, or disclose the prices of their menu items. The server charged me for 2 more plates than I had ordered, and rolled her eyes when I asked for the receipt. After retrieving it from the trash can, she pushed my receipt aside as she helped the next guest. \nDefinitely not getting my business ever again.",
      "author": "Krista F."
    },
    {
      "reviewRating": 1,
      "datePublished": "2018-08-05",
      "description": "The reasons why I gave this restaurant 1 star because lack of skills in making foods (there are bones in the sushi), second lack of preparation (menus aren't on the tables), foods are overpriced, third I can't figure out is that a bar or a sushi restaurant. No wasabi, no ginger on table.",
      "author": "Nam T."
    },
    {
      "reviewRating": 1,
      "datePublished": "2018-11-20",
      "description": "This place use to be one of my favorite places to get sushi. No I will never get their food again. I placed an order for delivery and when My food arrived it was missing an item. After speaking with the owner, I was told that they would not send the remainder of my order back out. Instead I would have to go out and get food someplace else while my family ate the sushi that was delivered. For this reason and this reason along I will not step foot into this establishment nor will i ever get food delivered from this place again.  Absolutely the worst customer service ever. This place should be ashamed of them selves for their lack of responsibility to complete an order that was placed and payed for.",
      "author": "Brandon S."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-04-20",
      "description": "1.  Good fake sushi.  I only come here because almost all there sushi has cream cheese in it.  I like cream cheese in sushi.  I'm weird.\n\n2.  Inflated pricing and SMALL portions of sushi, I come here sometimes because I live nearby but now i no longer want to be a customer.  I recently felt like I got ripped off, I ordered 2 seared salmons and 1 cream puff to go for $8.80!.  I usually dine-in and the past several times coming hasn't been that satisfying, usually leaving feeling MEH....Also, they use Cheap wasabi- doesn't have that real wasabi sting on tongue.\n\n3.  Usually cold inside and loud music, hard to hear when talking to someone.\n\n4. Servers are usually good at there Job.\n\n5.  Conveniently off 82nd. Ave.  Most restaurants off 82nd are fairly priced to cheap and Fujiyama is overpriced and they think there located off Sunnyside road in happy valley hills.\n\n6.  If I wanted to pay for overpriced sushi I would rather go to FUJI'S up the hill on sunnyside road.  At least they make there sushi fatter and there in house sauce is better.\n\n7.  Just like fake news, a lot of fake reviews on here.  Most of the great reviews are over exaggerated.  I been coming here for years and finally decided to stop supporting this place.\n\n8.  They either need to make sushi portions bigger and have the same pricing or lower pricing and keep portions the same.   Nowadays, many successful restaurants have huge portions, maybe they should follow.",
      "author": "Ronnie C."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-05-24",
      "description": "Food was good. Service was crappy. They only have low sodium soy sauce on the table and no wasabi or ginger, had to ask for those. When our server brought our food over she told us she spit it it. Then said she was just kidding and walked away. We were really grossed out and worried that she actually had. Still ate it because the calamari here is really good.",
      "author": "Kasi K."
    },
    {
      "reviewRating": 4,
      "datePublished": "2017-06-13",
      "description": "The sushi quality is great, ambience is great, one of the things that suck for me personally is how short I am and the chair versus height of sushi belt doesn't match up. \n\nAs far as I know, their fish is good quality, service is decent, not the best at being attentive but that's okay. Most people assume they going to pick off plates on the belt but there are people like me who like to order off the menu.\n\nI've been to both locations now and I think both are good. I am definitely coming back. If I haven't already enough haha.",
      "author": "Alekkz H."
    },
    {
      "reviewRating": 5,
      "datePublished": "2015-12-02",
      "description": "A cautious 5 star review.\nBelt and by the order sushi. Full bar available.\nService was attentive and friendly. Inside was attractive but there was a strong smell of cleaner.\n\nI tried several of my stand-by plates that I have at any belt style sushi, and got adventurous with a few that just looked like they wanted my to try them. \n\nPlates pricing starts at $1 and goes up to $4, with the average in the $2 range for much of what my date liked. I was more adventurous and tried a the $3 plates but our average was still just a sliver of salmon over $2 per plate. \nBut, we got in before 2 pm for Happy-hour so everything was $1.85 / plate. Cool.\n\nMy date likes the House roll. It had quite a bit of tuna and crab compared to other sushi places which are mostly rice.\nMy Philadelphia roll was a little disappointing, not fresh looking and flavorful as I have had.\nThe (fake) crab salad was nicely creamy and flavorful. \nOf the three $3 plates of fancier morsels I tried, only the salmon sashimi would I recommend.\n\nIf I did not consider my date's opinion I would give them a 4 star, room for some improvement. But as she felt her food was a notch better than other sushi places, the balance is to go ahead and give a, \"cautious\" 5 stars.\n\nI look forward to returning to try again.",
      "author": "Alan S."
    },
    {
      "reviewRating": 3,
      "datePublished": "2016-11-29",
      "description": "My friend was craving sushi and we were somewhat in the neighborhood, so we gave this place a try. Arrived at 6:30pm on a Monday, and the place wasn't at all packed, which was nice. Of course, we were in between happy hours. They run 3pm to 6pm and then again 8pm to 10pm. My friend jokingly said we arrived during the unhappy hours. \n\nWe were told to sit wherever we like, so we sat in front of the sushi train to scope out what they had to offer. A few of the little clear domes that go over the sushi to preserve it were horribly cloudy which made for quite the guessing game on what would be underneath. \n\nAfter a few selections off the train, we asked for a menu to see what else there was. I'm a huge fan of tempura, so I ordered the veggie tempura and the chicken tempura. Or so I thought. The first item completed was shrimp tempura, which we did not order nor want. My friend was kind enough to let them know that wasn't correct. So, they took it back and made veggie tempura...with shrimp. Eh, my friend ate the three pieces of shrimp tempura so that it wouldn't go to waste. The tempura was tasty. Once we got the bill, I noticed they charged us for shrimp tempura despite the fact we didn't order it. Oh well. I'd give this place a second try. Nothing fancy, but not bad.",
      "author": "Tara R."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-02-04",
      "description": "I like Fujiyama. I thought their places were a bit more pricy than I usually get, but I thought their rolls were quality and they had a really large option. It was a nice atmosphere, and the hostess was really polite and helpful. Overall a good place to eat if you're in that area",
      "author": "Chelsea C."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-10-24",
      "description": "Reasonably good sushi at Rock bottom price. Can't beat walking in and immediately gorging oneself on plates of $1.95 sushi.\n\nA little heavy on the creamy mayo sauces on rolls. I'm more a fan of the traditional fish-and-rice stuff.\n\nI think you can ask the chef to make you sushi or fried stuff and put it on the train, but they don't make it clear if that is an option or how that works.",
      "author": "TK H."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-03-14",
      "description": "This is a fantastic sushi place, friendly staff and fast sushi chefs. I love the music there and the vibe of that whole place!\n\nThey have an upstairs seating area which is such a cool place to rent out and throw parties at,  they have a full bar up there and a separate seating area with couches. Such a great addition to a sushi place! \n\nTheir sushi is VERY good and high quality! A big fan!",
      "author": "Alex L."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-05-13",
      "description": "We randomly stopped at this conveyor belt sushi, but the flavor wasn't really good enough for me to return, so I'm giving it a 2 star instead of 3. My miso soup was cold, which didn't things off to a good start. One of the soy sauce small bowls seemed dirty, and the ginger seemed old. The Long Island was on happy hour for $2.5, but you get what you pay for, so I was suspicious and expecting (and got) a mediocre drink. I was hoping for a map-menu to see what was going around on plates, but they didn't have one so each sushi choice was a complete guess. Of the 7 plates we tried, only 1-2 tasted good. Somehow the total came to $27, but we left not so satisfied.",
      "author": "Nick H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-02-16",
      "description": "Love this place/ homey eatery in our hood / attentive service and the conveyor  belt is so fun. A dependable place/ it's not haute cuisine but yummy in its own way- go! It's the Cheers of sushi places!!",
      "author": "C... D."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-10-30",
      "description": "This is the to go sushi spot. Fresh sushi you can taste it. And it has a bar! What more go eat and drink away. And the ambiance is awesome.",
      "author": "Saray S."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-07-18",
      "description": "Always love there tropical roll. Food always comes out quickly and correctly. Atmosphere is nice and wait staff is friendly and helpful. Love it here. Great sushi spot",
      "author": "Lisa W."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-03-21",
      "description": "Definitely my favorite sushi place! It never disappoints. Not only do that have amazing sushi at a decent price per plate but their grill dinners are another favorite of mine.",
      "author": "Suzie Q."
    },
    {
      "reviewRating": 1,
      "datePublished": "2017-02-20",
      "description": "Close to our place so we decided to give it a shot. Oh man... nope.\n\nWe walk in to loud, dated club music from the early 2000's playing on Spotify (interrupted, naturally, by ads every few songs) blasting from what sounded like a blown speaker. Sushi would have been \"okay\" but they absolutely DROWN every piece in sauce. Very Americanized and gross. Waited for the check until we headed to the cashier to take care of it ourselves. \n\nSkip this and pay extra elsewhere if you're into authentic, good sushi... you'll be glad you did.",
      "author": "Matt P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-04-12",
      "description": "Very good, fresh, sushi. Great service, can only say the best about these guys. I highly recommend the calamari, you'll see why :)\n\nThumbs way up",
      "author": "Alex I."
    },
    {
      "reviewRating": 1,
      "datePublished": "2017-02-08",
      "description": "3$ for this extra small plates of salmon?  I will never come back. Not even worth it, I could spend my money eat at better place. Your sushi is cheap as sushi land.",
      "author": "David L."
    },
    {
      "reviewRating": 1,
      "datePublished": "2019-03-14",
      "description": "Ate here pretty often but never again. Sat down tonight an immediately ordered a teriyaki dinner. My husband had a couple pieces of sushi but mostly we just waited for my dinner to come out. It wasn't very busy, and I hadn't been offered my soup or salad, so after waiting 20 minutes I called over a waitress. My order hadn't been placed. They apologized and offered to comp my meal. I thought that was a nice gesture so I said sure. She brought my salad and then 5 minutes later told me it was going to be a long wait. I asked why, and was told that three new orders had been placed and went in front of mine. It would now be at least another half hour until my food would be ready. I told them I didn't understand why my food was moved to the back of the line. They offered to give me a coupon for a free meal at another time. I will never understand why they would move my meal to the back of the line after forgetting me. Clearly those other customers' business was more important than mine.",
      "author": "Joshua A."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-09-21",
      "description": "Man, every time  I come in here the staff is really cool and nice. Thank you Franklin and Lisa  for helping me pick out my vegan options for my girlfriend. The sushi is good for the price but the staff is soo Damm cool ...... Thanks Yall..",
      "author": "Chad C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-02-11",
      "description": "Try the monkey brains, honestly this is amazing! The sushi is amazing. Stop in and enjoy a beer from roscoes rotating tap list, honestly great bar share!",
      "author": "Chuck M."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-02-27",
      "description": "Love this place.  Great chill place to get some quick cheap sushi and a beer.  Of course it's a bargain sushi train so people expecting the best sushi of their lives will obviously be disappointed.  Have been many times now and never had a bad experience.",
      "author": "Jonathan D."
    },
    {
      "reviewRating": 3,
      "datePublished": "2015-07-14",
      "description": "Went with a few friends for whom this is a regular stop. We got a couple of things off the conveyor but mostly ordered sashimi. The Saba, hamachi, salmon skin hand roll were all tasty. No off flavors, but neither was there the fresh sparkle of ocean salinity that characterizes really stellar sushi. Fish was also a touch warmer than I like my sashimi. Reasonable, convenient, friendly service. It's a good neighborhood joint near some friends. 90 bucks for 3 adults, a teenager and a 4 year old. \n \nI'm giving them 3.5 stars but rounding down just because it's not a 4 star sushi place. But I'd feel comfortable returning.",
      "author": "Dave K."
    },
    {
      "reviewRating": 5,
      "datePublished": "2016-11-02",
      "description": "I order take out from here at least 2x a week.  So much that they recognize my voice on the phone! Their Spicy Tuna hand rolls in soy paper are AMAZING!  I could live off the stuff!  They are open to creating rolls for you too.  Such a great staff!  Amazing chefs!  AMAZING food!  I swear they put crack in their sushi, I can't get enough!  Sometimes I just go in and order a martini, while I wait!  BONUS!  LOVE!  LOVE!  LOVE!",
      "author": "Zoe C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-04-23",
      "description": "One of my favorite sushi spots in town! Their rice is delicious and they don't construct their sushi with too much rice or fake crab.\nWhen I'm craving the fatty sushi covered in sauces I come here, their rolls tend to be on the richer side with saucy components. \nTheir service is excellent, the ordered food comes quickly, and the staff are incredibly friendly. Everything is clean and fresh. And killer happy hour deals too!",
      "author": "Marissa P."
    }
  ],
  "aggregateRating": {
    "ratingValue": 3.5,
    "reviewCount": 223
  }
}