{
  "telephone": "+13604339558",
  "priceRange": "$11-30",
  "name": "Pho Sen",
  "address": {
    "addressLocality": "Vancouver",
    "addressRegion": "WA",
    "streetAddress": "8513 NE Hwy 99",
    "postalCode": "98665",
    "addressCountry": "US"
  },
  "known-for": {
    "Takes Reservations": "No",
    "Delivery": "No",
    "Take-out": "Yes",
    "Accepts Credit Cards": "Yes",
    "Good For": "Lunch, Dinner",
    "Parking": "Private Lot",
    "Bike Parking": "Yes",
    "Good for Kids": "Yes",
    "Good for Groups": "Yes",
    "Ambience": "Casual, Intimate",
    "Noise Level": "Quiet",
    "Alcohol": "Beer &amp; Wine Only",
    "Outdoor Seating": "No",
    "Wi-Fi": "Free",
    "Has TV": "Yes",
    "Waiter Service": "Yes",
    "Caters": "Yes",
    "Gender Neutral Restrooms": "Yes"
  },
  "categories": [
    "chicken-wings"
  ],
  "review": [
    {
      "reviewRating": 5,
      "datePublished": "2019-08-08",
      "description": "Their pho is soo good \nIt is always my go to place even tho I live and work closer to another pho restaurant. This one is great \nStaff is awesome too",
      "author": "Ashley J."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-12-07",
      "description": "This is a hole in the wall kind of restaurant, kinda looks like it was converted into a pho restaurant from a buffet? There was 2 side kitchen type areas that was covered by alot of fake fruit.. don't try and take a bite.. \n\nIt's interesting that I like this palce so much because my experience in house was pretty off-putting and I swore I wouldn't give this place any more of my money, however, I just checked my recent door dashes and I HAVE been eating from here AND enjoying it! My restaurant experience was weird just because of the layout of the place, the service was nearly non-existent and I had to ask for several things several times because anytime I would ask for something the waitress just booked it to the back before I could finish what I was saying. On top of the service being off, my pho was almost TOO flavorful (let me explain) - i'd like to think of myself as a pho connoisseur, being that I know how it is prepped, cooked, and eaten. (The eating part i've mastered at this point.) I know what the brother tastes like when it's from the top, middle and bottom of the pot - And lucky me, I got the bottom of the pot what the flavor is most potent and the starflower is overpowering. I attempted to mask the taste with chili oil (Sidebar: CAN ANYONE TELL EM WHERE I CAN GET THE REAL CHILI OIL. NOT THE GARLIC PASTE PEOPLE MISTAKE FOR SPICE. ANYONE??) Sorry. The chili oil didn't do much but make me even more frustrated, I tried to water it down to dilute the flavor but just made a mess and accepted my defeat. \n\nAlthough the restaurant experience was off, as i mentioned above, i have recently been ordering from them through doordash and have been pretty impressed. Anytime I ask for chili oil and fish sauce, I get it! REAL chili oil (thai peppers blended/ground and fried in canola oil). I think there might be a language mishap though, instead of fish sauce/or the green cap squid sauce i've been getting the spring roll sauce which is Mae Ploy and vinegar and/or fish sauce mixture. Which isn't terrible but can bee too sweet to an already sweet broth. The veggies are nicely packed. The to-go bowls are nice (even though I end up mixing everything into a large mixing bow lol) Presentation in to-go foods have always been a disappointment for me but they have really impressed me ( to the point where I didn't even know these were the same place when I doordashed it lol). \n\nAll in all, the food is good, reasonably priced. The packaging is neat and presentable. I have ordered the pork and shrimp rolls from here and and equally been satisfied. 4 stars because I feel like I can't go back into the restaurant.",
      "author": "Katelyn L."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-11-25",
      "description": "Came here for dinner because K-Town isn't open yet. Tasty Thai food. Too much food? I suppose I'll have something to eat for lunch tomorrow. Quiet Monday night eats.",
      "author": "Serena H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-09-23",
      "description": "This spot is a nice \"hole in the wall\" find. Very clean restaurant with a simple menu outlining Vietnamese classics. We started with the crab wontons, and those were delicious! Served with a sweet and sour sauce. We tried the vegetarian pho and the stir fried noodles with chicken. Both were very good and full of flavor. Staff is very nice as well!",
      "author": "Sophia C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-11-05",
      "description": "Great options of different authentic tasting Pho. Very friendly service too. The seating is comfortable. The parking area is a bit funky but there is plenty of parking space.",
      "author": "Ann S."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-08-11",
      "description": "If at first you succeed, don't f it up the second time. \n\nOur first visit to Pho Sen was a pleasant dining discovery of Vietnamese-style favorites on old Highway 99. It was so convenient and comforting that we came back a week later. That meal wasn't nearly as yummy, so, I'm not a 100% sure what the real rating for Pho Sen should be. For now, I'm a 4-star fan and will be back because the third time is supposed to be the charm, right?.\n\nI've tried the Pho Tai (round steak pho) and Pho Tai Chin (round steak and well-done brisket pho). The Pho Tai on the first visit was really delish with thin soft snow-white noodles in a refreshing salty broth flavored to taste with extra jalapeño slices and fresh lime juice. The Pho Tai Chin served for the second meal was similar ... except the pho noodles were a single over-cooked lump. I should of returned the bowl, but just used my chopsticks to pinch apart the noodles. So, the 4-star pho on our first visit was a 2-star disappointment on the second.\n\nOur favorite food from Pho Sen so far has been the Curry Chicken with French Bread (rice is an alternate option) Soaking up the spicy curry sauce with bread is fun while the tender chicken was filling. Another recommendation is the Thai Spicy Squid Salad with cooked naked squid served in a spicy Thai-inspired sauce.\n\nThe only items I'll skip entirely at Pho Sen are the Banh Mi sandwiches. I tried a Grilled Pork Banh Mi that was a dry bread roll light on meat, veggies, and flavor. I ended up not eating half of the bread cause it was so hard while picking at the meat scraps.\n\nRe-reading this review, I'm wondering why I'm rounding up to 4 stars. I guess the reasons are the family-style friendly service, the location in an otherwise desolate restaurant wasteland, and the initial bowl of pho, comfort-food curry with bread, and spicy squid. Let's hope the third time really is a charming success for Pho Sen and they don't f it up even worse.",
      "author": "Michael S."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-05-30",
      "description": "I thought I wrote a review of this a couple weeks ago, but I guess not. \n\nSo here is my honest opinion, this place is great! Don't let the haphazardly placed sign (or lack there of) fool you. It's just starting out so give it a chance. \n\nThere are not a lot of ethnic places around here. Maybe it's the clientele in the area or maybe there just aren't enough ethnic people with restaurants, but whatever the reason, finding a good Vietnamese place to eat at is really hard. \n\nThe food here is so good. Their banh mi sandwiches are amazing! The best I've had in a while. They're skinny, but really long and they put all of the traditional (usual) ingredients on it. We ordered our food to go the two times we have been there and it was on point both times.\n\nThe fried rice is amazing. Their wings were sooooo good. My husband loved his Curry and even went as far as to say it was his favorite meal so far at a Vietnamese place. \n\nAnyway, we haven't eaten in so I can't say anything about service or atmosphere, but if you want good Vietnamese food at a decent price, go here. It's on our top list of places to eat in the Hazel Dell area.",
      "author": "Leah C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-06-18",
      "description": "I like pho. But I Love bun bo hue. I tried many in this area. Most places do not add pork blood at all because they're afraid to scare off customers.  Pho Sen: they let me customize it by adding more pork blood and even tripe! The price was just right: $13. The restaurant is large, great service, quick, with clean bathrooms. No other pho places worth driving to!",
      "author": "Alice M."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-04-07",
      "description": "Update - So I live about 30 minutes away from Pho Sen and when I got home with my Pho I put the noodles and meat into the broth and noticed that I didn't receive the baggy with the bean sprouts, sauces, lime, jalapeno and thai basil, which is a major part of Pho.\n\nI called them and they offered me some salad rolls, I told them I don't eat salad rolls. So I drove back down there and picked up the baggy of toppings. They gave me some salad rolls but I told them that I had already put the noodles in the broth and when I get back home the noodles will be soggy. They went into the back of the restaurant and I thought they were going to remake my order of pho but instead they just gave me more noodles. They said to take all the old soggy noodles out of the broth and put the new ones in. I was confused as to why they wouldn't just remake my order considering that when I get home the broth will be cold and the noodles will be soggy by then. \n\nAnyways, while their pho is pretty good, it's a good idea to check your bag when you order and to not expect much from their customer service. \n\nWhile I wasn't happy with paying for a cold bowl of pho with soggy noodles, I think this experience has given me the chance to try other pho spots around the area until I go back to Pho Sen.\n\nP.S. - The salad rolls aren't good.",
      "author": "James J."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-01-31",
      "description": "Got take out from here. Took 10min to prep. Very fast. Lots of food too! V2, vermicelli noodles with pork and 2 egg rolls, $11.87. Reasonable price for the amount of food. Tasty too. I'd definitely come back and try their pho and other dishes.",
      "author": "Mel W."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-09-01",
      "description": "We went here because they were open until 9 on a Sunday which is hard to find. My kids really enjoyed the chicken pho and there was plenty for them to share. My husband and I ordered the vermicelli bowl with pork, like we always do at Vietnamese restaurants. We both agreed it was average in flavor. The portions were very generous so if your really hungry you won't be disappointed. I'd probably give it 3.5 stars if I could. We'll keep it on the list of places we can go when we don't want to travel all the way to Portland for pho.",
      "author": "Heather M."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-03-11",
      "description": "Pho was very fast and tasty...the broth was the star as it should be. Little confused on the decor, looks like left over from a Mongolian grill. Service was lacking in attention had to ask server 3 times for more water and never did get an answer on if soda machine wasvworking. Overall it is worth a repeat trip.",
      "author": "Brad B."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-03",
      "description": "I'm giving 5 stars because I really did enjoy the pho and it was close to home. My only complaint was the lack of available hot tea and when they did serve tea, it was in a regular drinking glass and you couldn't touch the glass.",
      "author": "Adam P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-08-18",
      "description": "Delicious Pho - I've also tried their Pad Thai and it was also fantastic. Quick service, they check on you a few times. Have been back several times!",
      "author": "E W."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-05-18",
      "description": "Everything I ate here was delicious and they have vegetarian pho that actually tastes good!! Our group got the spring rolls, 3 different types of pho and crab puffs.\n\nThe rolls are amazing, and the sauce that comes with is just as good although its served cold. I tried the tofu spring rolls and my friends had the shrimp and bbq beef ones. We all agreed it was a good choice. The crab puffs had a lot of flavor too and that came with a sweet and sour sauce for dipping.\n\nGetting a large size bowl of pho will be good for 2-3 meals depending how hungry you are. I had mine for leftovers today and it tasted just as good. I love that they fry up the tofu so there's plenty of flavor unlike other places that just toss it in. I would come here again. Would recommend this place to anyone wanting to try it out. It's been a few other places before so don't like the banner sign fool ya, it's good!",
      "author": "Anna I."
    },
    {
      "reviewRating": 2,
      "datePublished": "2018-12-15",
      "description": "Well! Waiter was not very tentative and to top it off there was a hair on the plate that holds the bean sprout. And unfortunately it was after we ate most of the bean sprouts when we found it! They only offered us a 25% discount which barely covers the tax... if they have done more for us I would have given them three stars.. sucks to be  them!\n And if you plan on using the bathroom make sure to take some napkins because there's no toilet paper/ seat covers in the first stall. \nHowever overall the food was pretty good that's why they got the two stars.",
      "author": "Tami D."
    },
    {
      "reviewRating": 4,
      "datePublished": "2017-11-15",
      "description": "This place is fantastic.  Their fresh spring rolls are a must try and I just love the \"V1\"...special vermicelli noodle dish.  It has just about everything in it...shrimp, pork, spring roll, etc.  \n\nI've also had the fried spring rolls as well and my grandson just loves 'em!  It's relatively new, so get out there and support your local restaurants.  I haven't tried the pho noodle soup yet but from what I've seen, they look great and I've placed it on my to do list...happy eating!!!",
      "author": "Dean D."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-04-27",
      "description": "I like Pho Sen. I don't love it. \n\nI've been here 4-5 times.\n\nTheir staff is friendly but extremely slow. You have to hail them down or make eye contact for everything (including someone to take your order, get you a drink, or give you your bill).\n\nThe vegetarian pho is decent although I feel its quality has been slowly decreasing since we first came. What once had a bounty of fresh veggies has just gotten saltier and more stingy.\n\nThe last time we were here there were dead bugs all over their window sill next to the table.\n\nUnfortunately we won't be returning. However, I wish this family the best!",
      "author": "Jamakea T."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-04-21",
      "description": "I've been sick for a few days and was craving hot, delicious broth and fresh veggies, so why not pho? My craving brought me to pho Sen since its the closest pho restaraunt and was left with a very mixed bag of feelings. \n\nI called and placed an order for pickup to go. Beef pho and salad rolls sounds simple right? Well....to start the prices are fair but it is an old Mongolian grill that has not changed what so ever. They still have the old signs, etc of the last failed restaurant. Not that big a deal. So I picked up my food and the lady was pleasant and I went home. When I opened up my bag of food I found several errors. I ordered veggie salad rolls and got pork instead. Not a huge deal but I dont like meat said rolls nearly as much. \n\nNext, I went to assemble my pho and everything looked good except a side bag of raw beef that was included. I have had pho countless times from countless places and I never received raw meat. It was very strange indeed. I did a quick cook of the raw meat and added it to my pho. Other than that I enjoyed the pho. The broth was flavorful with some spice and I always love the snap of raw veggies, etc. \n\nOverall I'm undecided if I would return. I certainly wouldn't go for the ambiance or location and I usually don't mind going to Portland for a significantly improved dining experience. I would grade pho Sen a C-.",
      "author": "Michael B."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-07-29",
      "description": "Top authentic Vietnamese.  The southern style Pho is rich brothy and aromatic.  I love the Vietnamese sliced lotus salad with seafood or fried crispy tofu on top.  Grilled pork with shrimp or grilled chicken with vermicelli are delicious.\n\nDon't miss the smoothies, large, thick and real fruit.\n\nNice seating, quiet and good A/C",
      "author": "Cliff H."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-03-17",
      "description": "Fast service, nice and friendly people and absolutely loved the food! We ordered the chicken pad Thai and the pork soup.... soooo good!",
      "author": "Kisha C."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-09-29",
      "description": "I've gone here several times and the food is delicious. Upon entering, it seems to be a confusing amalgamation of past eateries; Italian decor atop Mongolian adornments, with bizarre plastic representations of food they offer... Looking beyond the decor, the service has been good and bad depending on our waiter. In the past, I have had trouble getting refills on tea. I suggest simply acknowledging that the cup is empty if this is a trouble for you as well. \nBeing seated, the restaurant is a nice size and the booths are comfortable. The tables sometimes seem a bit sticky and I've noticed the wait staff don't seem to wipe the areas near the sauces very well. The menu is full and has lots of options for vegetarians, vegans, and carnivores! Plenty of different things to try or add to your pho. This is a great spot for a beginner pho taster. \nThe vegetables here are so fresh and tasty, and I love the seasonings they use. My favorite offering is the curry. It comes with eggplant, my favorite vegetable. The flavor of the curry is outstanding and exotic to the tongue; this curry may not be familiar to your palette. Give it a try! The food is prepared in a timely manner and presented beautifully. I highly recommend the crepes and traditional pho. Ask the waiter what he recommends! His opinions seem spot on every time I'm here. The management seems in touch with social media as they have responded to me and other diners' reviews.\nTL;DR Ignore the decor. Try the pho. Acknowledge when your cup is empty. Great little spot!\nBonus tip: It's pronounced \"fuh\" with a gentle \"u\" sound. :)",
      "author": "Lindsay B."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-07-11",
      "description": "Hangover cure! No, but really the Pho here is one of the best plus their Thai milk tea coffee is second to none!",
      "author": "Lupe M."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-10-09",
      "description": "Omg so good!!! I can't even write anything bad about the food. But what I can say is the service isn't that great. Most restaurants give you 100% attention but this one gives you 30% however the food makes up for it.",
      "author": "Natisha N."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-11-11",
      "description": "This little place just keeps growing on us and continues to get better each time.  The Pho is great.  The combo fried rice is wonderful (reminds me of fried rice I had growing up a child in San Francisco's China town) sold and taste.  \nThe Thai sandwiches are taste, great French bread. \nThe peanut sauce is not the best I've had but also not the worst. \nThe family that runs it are so kind and humble.  \nGreat little place and it's close to where we live.",
      "author": "Scott L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-02-22",
      "description": "Honestly the best consistent Pho in Vancouver that I have found. The wings are also amazing! Don't be put off by the fish sauce scent, they kick regular wings butt!",
      "author": "Leah S."
    },
    {
      "reviewRating": 2,
      "datePublished": "2019-04-07",
      "description": "Updating review after a recent crummy experience. Drove 25 minutes to pick up pho and drove all the way home (40 minute round trip) and started putting the bowl together before we realized they had left out all the Thai basil; sauce, sprouts; etc. called pho sen to let them know and they said they were sorry about would have it ready for us if we wanted to drive back. We tried the pho without the extras and it's just not the same. Drove all the way back and let them know I had already put the noodles in the broth and asked if they could replace the broth/noodles since after 90 minutes it will no longer be any good. The refused and just gave me some extra noodles. Way to lose a good customer over a $9 dish. I'm on to finding a new pho spot.",
      "author": "J R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-07-29",
      "description": "Favorite pho place hands down!!! Best chicken pho in Vancouver. I'm a pho snob, and I've tried them all....This place is still my favorite! Also, if you order pho TO GO the soup is put in a really nice container! I go here at least once a week. So much better than the old bamboo hut! We needed this on the west side!!",
      "author": "Cortney C."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-02-10",
      "description": "Negatives:\nService (it's pretty terrible) \n\nThey forgot to give us water.\nTable was cleaned for us but still had things left from previous customer on it.\nThey usually take a long time for take out orders even when there are few customers.\n\nMy soda had ants in it.\n\n\nShould definitely get some proper training for staff.\n\nThe baby high chair was dirty.\n\nWe came the 45min before closing and were turned away. \n\nLots of negatives.",
      "author": "Vanessa R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-02-15",
      "description": "Vancouver seems to be opening a new Pho joint every few months. That said, this is one of the best I've tried. Their wings are different, but right up there with Pok Pok. The plastic donut decor is weird.",
      "author": "Terrell T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-11-19",
      "description": "My husband and i came in on a whim, hung over and looking for a good broth. Qe orders a pineapple boba tea..It was great! We has the Pho and a sampler platter. Delicious, full of flavor...Definitely cured our hangover for sure\n The bowls are so big we took somw home for later. It was equally as good warmed up at home. Service was attentive and friendly..we also loved how spacious it is. We will definitely be coming again and again.",
      "author": "Nicole H."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-02-24",
      "description": "I love pho. I'm a Asian and have been eating asian food since birth. The Broth is what makes the Pho great. Each restraunt family has their own secret recipe. This place didn't really delivered that WOW broth. Just no flavor at all. The prices were little more expensive then expected. Bowl of large pho should not cost more then $10.  If you want great Pho try another restraunt. See my other review of great restraunt for pho. This place really didn't deliver what I expected in great Pho.",
      "author": "Johnny A."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-02-08",
      "description": "I love everything about this place, love the decor, love the food, the bonmi sandwiches are delicious, Pho  is awesome, and the V1 was one of the most unique and delicious things I've had.",
      "author": "Jesse M."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-11-17",
      "description": "We love Pho Sen!!! Great food, wonderful atmosphere, good seating and staff is #1!\nHighly recommend Lauren",
      "author": "Lauren L."
    },
    {
      "reviewRating": 1,
      "datePublished": "2017-11-13",
      "description": "Well, my wife and decided to give this place a 2nd chance this evening since our first time trying we were both a little under the weather.\n\nIn our first experience they messed up our order (both got pho, but didn't have all of the right meats), it wasn't very clean, and service lacked.\n\nTonight on our second try, the first thing we had to do was request our bench be cleaned off before sitting.  There was a random pair of chopsticks by the sauce tray, but we were hungry so just thought about the food.  We clarified our order clearly so we wouldn't run into the same situation as our first try.  Well, they messed up our order again to which this time we said something and we were told it was right, until they looked at our pho and then questioned the chefs.  They brought the missing meat and apologized, but it wasn't sincere.\n\nThis time as you'll see in the photos, our bowls outside were dirty with what looked like blood or something,  but it was both of our bowls.  Should we have just left then, yes, did we stay and end up just eating it yes, was that a mistake,  yes.\n\nWe tried to give them 2 chances and the 2nd was absolutely disgusting and now that my wife are both sick (in the bathroom).  \n\nWe will never go back here, so please, if you do decide to try, stick to your gut if something is dirty or doesn't seem right and just walk out.",
      "author": "Jace R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-12-03",
      "description": "By far our favorite take out spot, their vegan broth is easily the tastiest I've had, toped with tons of fresh veggies SO GOOD",
      "author": "Ashley F."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-07-10",
      "description": "Finally! I was very happy. The outside is deceiving. But the food was fresh and amazing! The steak pho was perfect. Spring rolls delectable! We will be back! Lots of options on the menu. As mentioned in other reviews, you may have to be patient with the servers, but it is worth the wait! The servers are clearly trying to make sure everyone is taken care of. :)",
      "author": "Chrissy B."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-01-04",
      "description": "I love everything I have had to eat here. I like shrimp Pho not on the menu and they accommodate me :) I have to add all my spices but that's fine. My family likes the sandwiches (both chicken and pork), egg rolls, and the dish where you roll your own rolls and dip them in fish oil (sorry I don't remember which one it is without a menu). The main improvements I would like to see are 1) faster food preparation time and 2) drink refills more often. We have been going here occasionally for a couple of years and I think the service is improving.",
      "author": "Sina T."
    },
    {
      "reviewRating": 2,
      "datePublished": "2019-03-03",
      "description": "We came at 10, they weren't open til 10:13.... food took about 25 minutes for pho. Pho was ok.",
      "author": "Sandy D."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-10-12",
      "description": ":::VEGANS::: This place is DELICIOUS!!! I ordered the small vegetarian pho and the tofu salad rolls with peanut sauce, everything was incredible! The service was top notch, the location is very, very clean and HUGE (if you're looking for a place to have a party/get together). I would HIGHLY recommend this restaurant to anyone, in fact I returned to work with a handful of menus to encourage coworkers to try them as well! Cannot wait to go back!!\n\nUPDATE 10/17/17: Returned tonight for dinner with the dude... We ordered two large bowls of vegetarian pho (vegan), which has homemade vegetable broth (contains cashews), an order of vegetarian fried rice that was easily veganized by asking for no egg and the vegetarian tofu salad rolls (vegan). It was much busier tonight for the dinner rush (vs. my lunch hour last Thursday) but they handled the packed house with grace! I am in love with Pho Sen and Hazel Dell is lucky to have a restaurant to this caliber, that is affordable yet extraordinary! This will definitely be a regular stop for us :o) \n\nPS- They DO NOT use any MSG or soy sauce in any of the dishes, meaning the food is tremendously flavorful and they have gluten free options!",
      "author": "Elizabeth M."
    }
  ],
  "aggregateRating": {
    "ratingValue": 4,
    "reviewCount": 102
  }
}