{
  "telephone": "+15036483542",
  "priceRange": "Under $10",
  "name": "Pho Tango Vietnamese Bistro",
  "address": {
    "addressLocality": "Hillsboro",
    "addressRegion": "OR",
    "streetAddress": "22139 NW Imbrie Dr",
    "postalCode": "97124",
    "addressCountry": "US"
  },
  "known-for": {
    "Health Score": "97 out of 100",
    "Vegan Options": "Yes",
    "Takes Reservations": "Yes",
    "Delivery": "No",
    "Take-out": "Yes",
    "Accepts Credit Cards": "Yes",
    "Good For": "Lunch",
    "Parking": "Private Lot",
    "Bike Parking": "Yes",
    "Good for Kids": "Yes",
    "Good for Groups": "Yes",
    "Ambience": "Casual, Classy",
    "Noise Level": "Average",
    "Alcohol": "Beer &amp; Wine Only",
    "Good For Happy Hour": "No",
    "Outdoor Seating": "Yes",
    "Wi-Fi": "Free",
    "Has TV": "Yes",
    "Dogs Allowed": "No",
    "Caters": "No"
  },
  "categories": [
    "chicken-wings"
  ],
  "review": [
    {
      "reviewRating": 5,
      "datePublished": "2019-11-20",
      "description": "I came here for a weekday lunch and had the pho. I don't know this didn't occur to me since it's right next to Intel but I hit the lunch rush competing for a table with all the Intel employees. So if you want to avoid a crowd, don't come during lunch time on a weekday. \n\nFood: I had the pho special (everything in it). I really liked the flavors, the meats, the noodles, the big bowl it came in! It was delicious! I think it's probably one off the better pho places in Portland! \n\nService: So friendly, fast, and nice! Although after they gave us our food, they didn't really come back around to refill our water. \n\nAmbiance: It's a large restaurant with TVs that lined the walls. There is a wall of champions and wall of shame that had quite a lot of pictures on it. I think there's a food challenge here. There are these cute small booths (only fits like 2 people) near the windows so it's a nice spot to hang out with just one other friend and have a quiet chat with a nice window view of cars passing by. \n\nPrice: The pho was $11.25, which I think is pretty expensive. But once I saw how much they gave you and the big bowl, I guess I get it. And it was pretty delicious!\n\nOverall: I would totally come here again! Just can't come that often since it can get pricey but maybe if I'm really craving a pho fix! And I am interested in trying their other items too!",
      "author": "Amiee H."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-11-17",
      "description": "Came back for nostalgia sake as I used to come at least monthly when I was working at the salt mine nearby.\n\nOrdered the 10 Pho, the soup base and noodles was still stellar, 4, but the meat was terrible, thick and old, total dish a disappointing 2\n\nSpring rolls, 4 \n\nAvocado smoothies once my wife's favorite was too sweet 3\n\n\nSo different since the ownership change.  Overall a disappointing visit and likely not going to do the drive west anymore.",
      "author": "Charles C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-11-05",
      "description": "Super nice people here!! They have an awesome pho challenge and their food was absolutely amazing \n\n2lbs of noodles and 2lbs of meat to finish in an hour you don't need to finish broth!",
      "author": "Raina H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-12-08",
      "description": "The pho at this place tastes super beefy which is superb. The portion size if the regular is decent and making it an extra large is worth the extra money. Typical vegetables are served with it which included bean sprouts and mint leaves. The staff is friendly and service is quick. There is even a pho challenge here which is to eat 2 lbs of noodles and 1 lb of beef in one hour. Thought I could easily do it, but with the rice noodles expanding over the 1 hour time, I didn't quite make it sadly. Was happy to give it a shot though! The pho was delicious!",
      "author": "Richard P."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-12-16",
      "description": "It was ok. Shrimp pork salad rolls were very fresh & tasty. The peanut sauce was tasty. I ordered the grilled honey lemon beefsteak w brown rice vice noodles. The dish came w a small amount of pickled veggies & some cucumber slices. Meat wasn't very strong flavored but was tender. The veggies didn't last long & wen I asked for more thy wanted to charge me $2. Annoying!!  Place is sparkling clean. Big windows. Lots of light.",
      "author": "Glenn T."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-11-22",
      "description": "Average food, nothing to rave about. Ordered the chicken Pho with Egg noodles, weak broth, lacking in flavors, noodles were lackluster, great attentive and professional service..",
      "author": "Abhishek S."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-08-25",
      "description": "I grabbed to go from here and at first I was so pleased... I had the crab wontons which were delicious and then the salad rolls...even better. \n\nBut the orange chicken...even with the ridiculous amount of sauce there was like no flavor except sweet - just sugar syrup. I got fried rice to go with and nope, no flavor....none. How? Just how? My friend had their shrimp fried rice and she was saying the same thing - there was zero flavor. \n\nI might actually go back just for those salad rolls though!",
      "author": "Mikhail H."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-09-05",
      "description": "A decent option for Pho if you're really craving it. We went on a weekday and was surprised as to how packed it was which was a reassuring sign. \n\nWe started with the pot stickers which were decent. They had a good crunch to them and although the pleats were uneven it gave them a homemade vibe. The stuffing was good and warm on the outside. Unlike most places they dripped the vinegar across the pot stickers rather than serving it on the side. I was ok with this, although I can see how some people may not like this. \n\nI was somewhat rushed to order (my fault not theirs) and was unable to fully browse the menu. I ended up going with the round steak and the meatballs. Personally I enjoy the whole nine yards including tripe and the such but was unable to find the beef special option for this. That being said the bowls are huge and the stock is what you come to expect of Pho. My one gripe was the ratio between protein and noodles, as it seemed a little low from prior experience.",
      "author": "Joshua L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-10",
      "description": "My go-to for vermicelli. Came with my girlfriend the other day and we both got 2 number 24's (pork and spring roll) and salad rolls.The vegetables they use are so fresh and the meat is really flavorful and perfectly cooked. The staff are just attentive enough and the food comes quickly. \n\nMust try if you're in the area! I've been coming here for years and they never disappoint.",
      "author": "Alison H."
    },
    {
      "reviewRating": 3,
      "datePublished": "2018-11-18",
      "description": "After watching a movie decided to head over for some pho and didn't know this mall plaza existed but here we are, the yelp reviews were great which is one reason we checked this place out. \n\nA Sunday just after 5pm, the place was larger than expected and lots of diners. I like the set up of small tables, large ones for groups, small and large booths too. Upon being seated, our water glasses were filled after our menus were given to us. \n\nWe took a minute but ordered a salad roll appetizer, #11 pho, and vermicelli bowl of lemongrass beef. The salad rolls came out right away- thick rolls and decent peanut sauce. Literally 5 minutes later our main orders arrived. The side garnish was already out with our appetizer. I did not have the pho, but it was devoured. I had the vermicelli bowl and it was just the right portion, lots of beef too though a part of it was nearly raw on one side. \n\nThe service was fast and the environment was casual, a great spot but just thought a couple things would of made it better. We were not checked on and did not get our waters refilled. Also, we did not know if we went to the front to pay or if our bill was brought to us- a little confusing. Another confusing aspect was that we had to ask for chopsticks as well, thought they would be on the table already with the fork or given to us.",
      "author": "Jina H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-09-29",
      "description": "This place is ok if you're looking for a quick meal. Not spectacular by any means.\n\nThe good : The beer broth in the pho is fantastic and the meats are succulent. The service is very friendly.\n\nThe bad: Not much attention is paid to quality control. Last time I was there (been there 3 times), my rice noodles in the pho (beef special) were this giant hard ball; like they'd tossed it from a container straight into my bowl. Had to fight with it to break it up. That was disappointing.\n\nIf you do go there, I'd recommend asking for a small size, especially if you plan on doing anything later, eve watching TV. I eat large, but the regular size is huge. Wasting food is never a good feeling.",
      "author": "CoffeeCup C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-09-03",
      "description": "Quick service.\n\nFriendly staff. \n\nLove the food here.\n\nUsually order the vermicelli bowl and pho.",
      "author": "Thuy N."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-05-26",
      "description": "The beef special is their most popular for a reason. Classic pho order to satisfy your needs. \n\nThe spicy noodle soup on the other hand was not very good at all. The meat tasted a little off and the broth was barely spicy. The sprouts came purposely mixed with sliced lettuce for some reason. \n\nNot pictured- pork and shrimp spring rolls. Exceeded expectations.",
      "author": "Aakash R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-11-16",
      "description": "Fast service and their pho is absolutely delicious! I'm definitely going to be coming back again.",
      "author": "Demah E."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-07-01",
      "description": "Love the pho.... the soup is really tasty and one of the best I've ever tried. The size is good and the meat is good from both the cutting and the amount. So, the pho itself is 5 stars.\n\nThe fresh rolls/summer rolls are just average, this is rather disappointing because normally in Vietnamese restaurant, this is one of the key unique appetizer that needs to get some attention. I found the meat is rather blend in the rolls (normally you could feel the grilled marinated pork meat inside, also too much noodles...\n\nThe service is OK, so four stars it is.",
      "author": "Stephen L."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-07-09",
      "description": "This place is delicious tasty and the service is good I would have given it 4 stars but it's a 3 i ordered the house pho with 5 different kinds of meat I'm trying to eat healthy and substituted the rice noodles with extra veggies we did get appetizers of salad rolls and fried tofu which was good my pho came but the veggies were gone they did send a few 2 pieces of broccoli and some slices of carrots a meatball cut in half a couple slices of flank steak a couple pieces of tendon one piece of tripe and a piece of brisket but enough tasty broth to fill you up  the place was packed so maybe they had to stretch the product for everyone it was good like I said 3 stars the last few times I did eat here it was definitely a strong 4 but tonight it was a weak 3 what happened to consistency I won't let tonight's meal keep me down I'll definitely be back because I know that the 3 will be a 4 ...",
      "author": "Andrew L."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-09-21",
      "description": "The food was delicious.  Excellent comfort food.  Clean and friendly staff.  First Pho experience for our family and we all enjoyed it.",
      "author": "Jason W."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-07-10",
      "description": "It takes two to Pho Tango! Partner and I ate here for the first time last night, because pho's the obvious choice on a rainy, cool Monday evening in July. The place was packed, but we were seated immediately.\n\nWe ordered the crab cream cheese wontons to start. These were good, fried perfectly, hot, with lush filling. They tasted freshly made in house, not frozen. Jury is out on how much crab is actually in these, but we enjoyed them and the sauce they came with.\n\nBF ordered the eye round steak & brisket pho (#17) and I ordered the vegetarian pho (#20) with beef broth, both large. Our orders were taken promptly and they're inputted on tablets, which was cool and unusual.\n\nI tasted the broth before adding spices. It was excellent -- some of the best beef broth I've ever had in pho, flavorful and delicious. The portions were certainly large. My pho chay had the usual rice noodles, green onions, white onions, and then broccoli, green cabbage, carrots, tofu. There were about 6-8 pieces of tofu, which seemed fair for the price. I thought the vegetables could've used some more variety -- the best pho chay I've had also included water chestnuts, baby corn, etc. The carrots were just a little lacking in quality, but only enough to notice, not enough to ruin a meal. Noodles were standard -- good and not overcooked.\n\nBF also enjoyed his steak/brisket pho and agreed portions, flavors, and so on were all great. The lime/bean sprouts/Thai basil/jalapeno were all fresh and clean. Chili was good, sriracha was as usual.\n\nOur bowls of pho came out maybe 10 minutes after ordering; we were actually still eating our wontons when they came out. Despite how busy this place was, service was accurate and efficient. \n\nOverall, we really liked it here and will happily return.",
      "author": "Chris A."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-10-23",
      "description": "Went during the week at peak of lunch time. Big mistake. Super crowded, hardly anywhere to sit. Very popular with Intel peeps.\n\nPho is very good. Not the best I've had, but very good. Lots of options too: beef special ($10.25): eye of round, well-done flank, brisket, soft tendon, tripe & meat balls. They have a shrimp pho I'd never heard of before as well as a vegetarian noodle soup with veggies & tofu.\n\nIn the vermicelli (bun) category, all the usual ones are on the menu: lemongrass chicken, beef, pork, beef steak, and a salmon that was actually surprisingly good. Served with rice and a small salad. The rice plates (com) are also worth taking a look at: grilled pork, shrimp, chicken, along with spicy cashew nut chicken, crispy orange chicken, and even a pad Thai noodle dish. The iced Vietnamese coffees looked delicious but alas, too sweet for my taste.\n\nPho Tango is open 7 days a week and I recommend going way after the regular lunch hour and very early for dinner. A very popular place for al the right reasons.",
      "author": "Cathy P."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-05-10",
      "description": "I was visiting here for a lunch meeting for work. I arrived before my guest and the staff here were very friendly and helpful. They let me pick my table which was super nice. The menu here looked incredible. I couldn't order that much (it's hard to talk at a meeting and eat at the same time- plus I was traveling and couldn't bring back leftovers), so I had to go with something small. I saw some reviews raving about the potstickers so I gave them a try. WOW. They were insanely delicious. Probably some of the best I've ever had. I really loved them. Although they are an appetizer they worked as a small meal. Service was great during our meal. Would love to come back to try the Pho!",
      "author": "Meghan B."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-11-06",
      "description": "This is one of our staples! Service always great and food consistent. Our son requests to go here once a week.",
      "author": "p M."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-01-15",
      "description": "Inconsistent soup for their phó. Some days are better than others and the other days are just okay. Because of this, I stick to the rice plates or rice noodle bowls.\n\nService is consistent with most other Chinese/Vietnamese restaurants, fast to get the food out and then they'll leave alone. You pay at the cash register. \n\nMeats here is good,  it has a different flavor to what I'm used to back home and the price is a little more than what I'd  pay for back in San Jose. \n\nIt's good despite the three stars but something is missing here.",
      "author": "Sam T."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-07-05",
      "description": "First time in Oregon and wasn't so sure about how Vietnamese food would be here.  Surprisingly, it was pretty good.  We ordered Pho, egg rolls, and pork & rice dish and all were delicious.  My favorite was the pho broth - so flavorful & almost sweet.  Glad we tried this restaurant and will come back when we visit this area!",
      "author": "Susan S."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-05-09",
      "description": "For all you vegans and vegetarians out there, try #20, it's a veggie pho with tofu and veggies it's absolutely delicious! BUT, triple check when you get your pho especially to go because there's been three instances of when they've given me beef broth on accident. Luckily I recognized the color difference (a distinct brown tint) and they did come running back every time to correct their mistakes but if I was a faster eater I would've been five bites too late!\n   \nAnother problem I run into is when I specifically ask for no plastic bag or silverware for my to go orders, but every time they seem to not hear my request and I have to repeat myself. I know they aren't used to people asking for this but I'd like if they took a moment to hear my request.\n   \nBut the reason I gave 4 stars after my stated negatives above...? Cuz overall it's a great place to go, they are very friendly, and the place is really clean and modern, their pho is so yummy that the yays outweigh the nays!",
      "author": "Hadley R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-11-09",
      "description": "My favorite pho place in hillsboro.  The service is always quick and the pho is full of flavors. The portion is plenty and the price is right.  They have a wide selection of entrees, I would definitely recommend any of the vermicelli bowls if you are not in the mood for pho.",
      "author": "Denah T."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-06-25",
      "description": "Coming from southern CA (orange county) I've been spoiled with an abundance amount of Asian food (specifically Vietnamese) left and right. When I moved to OR, I was craving the same comfort food I got back home and Pho Tango nailed it! I've tried lots of Vietnamese restaurants in OR and Pho Tango is the best so far for the price, portion, taste, and not to mention variety!\n\nVermicelli - I've tried all their proteins here w/ the vermicelli. The best is the pork! The beef was cut a little weird, they're thick cut instead of thin like the pork. The chicken is dark meat, but you don't get as much as you would the pork so stick w/ the pork. The salmon is a very generous portion, but this is the first time I've had Salmon Vermicelli so it was a bit different (it's really healthy). They also let you do the option of no noodles so you can get just veggies & protein! Their fish sauce that you pour w/ the vermicelli is on point.\n\nPad Thai - Their pad thai here is really good and better than other Thai places I've tried! I like that they don't make their noodles as wet and orange as other places so it's not drenched in sauce! It's also not to sweet which makes it perfect. They're also very generous with the amount of chicken given in the pad thai. \n\nOrange Chicken w/ brown rice - This is probably a dish you'd have to dine in for. I got it to go and didn't really like it. It wasn't crispy and the batter was soggy. The sauce was a bit too sweet as well. \n\nBeef pho - Decent sized portion for the price. The broth is nice and hearty, but I think they do put MSG in here 'cause I felt sluggish and wanted to food coma after eating the pho. However, their broth tastes great and smells wonderful!\n\nPho Tango is conveniently located in the Fred Meyer's plaza and it is definitely my go to when I'm craving Vietnamese food! FYI, they get really packed on rainy days for the pho",
      "author": "Tracie L."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-09",
      "description": "Super quick service and excellent, fresh food. I will definitely be back! Their salad rolls and Vermicelli bowls were phenomenal!",
      "author": "Candace H."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-02-19",
      "description": "Love the Pho here!! Pot Stickers are to die for, some of the best I ever had! \nI don't think I have had anything yet i didn't like! \nOhhh... free refills on the Thai tea! gotta love that!",
      "author": "R C."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-09-20",
      "description": "Have been here twice for lunch and both times just plane amazing.  The fresh spring rolls with shrimp are perhaps some of the best I have ever had and the Grilled Shrimp and Beef is a real pleaser.  Service has always been fast and friendly and the price for what you get is more than fair in this Yelpers book.  If you go for lunch get there early or you may have a wait!",
      "author": "Bill D."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-12-06",
      "description": "My favorite pho place to go! They're pho beef noodle soup and pot stickers are always my go to",
      "author": "Manuela P."
    },
    {
      "reviewRating": 5,
      "datePublished": "2018-09-16",
      "description": "We took a chance trying a new place and definitely weren't disappointed. I got the lemongrass pork vermicelli noodles and they were delicious! We'll definitely be back next time we're visiting our family in the area.",
      "author": "Taylor J."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-03-22",
      "description": "Nice hot pho is a godsend in cold rainy weather. Good ambience and service. Must try pad Thai for vegetarians. Good option for team lunch.",
      "author": "Aalay K."
    },
    {
      "reviewRating": 4,
      "datePublished": "2018-04-27",
      "description": "Time for an update, 4/18\n\nMy lifestyle has changed and I no longer eat more than about 30 carbs per day, consisting of lean meats and very low carb veggies and fruits.  No sugar, no artificial sugar, no grains, pastas or rice.  It is a little harder to find things I can eat at a Restaurant.\n\nToday I was at the DMV and decided to see if Pho Tango could accommodate my eating habits.  I am pleased to say yes they did and I was able to enjoy one of my very favorite foods, PHO!\n\nI ordered my usual #11 and asked for no noodle, extra onion and jalapeno, they then asked if they could add veggies for me, I said Yes please.\n\nIt was delicious and really hit the spot.  They included cabbage, broccoli and a few carrot slices (which went to the doggies).  \n\nThank you Pho Tango!",
      "author": "Cheryl D."
    },
    {
      "reviewRating": 5,
      "datePublished": "2017-04-27",
      "description": "Food ****\nService *****\nPrice ****\nOne of the best places in town, you should try Pho with meat! Also excellent service!",
      "author": "Baltazar R."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-03-31",
      "description": "We've tried Pho at a whole bunch of places in the relative Hillsboro/Beaverton area, and this is hands-down my favorite. It's always fresh and absolutely the most flavorful. I'm done trying other places because when we do they disappoint in comparison to Pho Tango. We go at least once a week, we love it!",
      "author": "Liz L."
    },
    {
      "reviewRating": 3,
      "datePublished": "2019-05-19",
      "description": "My second time here, and my last time\nFood was ok,  I wait long time to get a table after I put my name on a waiting list  but the waitress come straight to a couple and ask to fallow her when it was my turn she don't even look at me I was in front of her ejes, but the other couple say that it was my turn, So why they make put your name on it when she just came and pick wherever she wants, it was RUDE!!! The never came to my table see if I need something else.",
      "author": "Ervin F."
    },
    {
      "reviewRating": 5,
      "datePublished": "2019-05-17",
      "description": "Excellent service and delicious pho! They boxed up all my leftovers and surprised me with extra sauce to-go. They were able to do the avocado smoothie dairy free too :)",
      "author": "Casey B."
    },
    {
      "reviewRating": 3,
      "datePublished": "2017-11-28",
      "description": "We came here to eat after Thanksgiving because our neighborhood pho shop was closed still from the holiday break. This is a frequent place my man friend goes to since he works at Intel. \n\nWe placed our orders and note, a large is just 50 cents extra. Overall, it was good service, you are seated immediately and we got our pho bowls within about 10 minutes of being seated. \n\nI've been to a few places in my time and just a few things to point out. I've learned in the past year of living in Oregon that pho places will charge accordingly for the food that is presented to you. Yes, 50 cents is a bargain but I don't feel like I got that much more quality for the \"large\" option. Meat that I got was chipped and I didn't get any sections where the meat stayed intact. Much of it crumbled with slight manipulation with my chopsticks. Meatballs were the little pre-packaged ones that they sliced into odd halves strewn about my bowl. Veggies and sprouts weren't the freshest I've had. If anything, I got an overabundance of broth that mostly got in my way. It wasn't broth that I would say makes this place a standout among the joints I've visited.\n\nGood in a pinch but I'd still rather go to Pho Nam in Progress Ridge.",
      "author": "Jennyfer N."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-05-02",
      "description": "I really like this place. The staff are really nice and fast. I always get what I ask for. Bún Ch Giò Tht Nng- Grilled honey lemongrass pork (little grissly but good flavor) and springroll (perfectly crispy) with an extra springroll. They always cut up my 2nd springroll for me in the bowl without asking. It is perfect and refreshing.",
      "author": "N M."
    },
    {
      "reviewRating": 4,
      "datePublished": "2019-02-24",
      "description": "Decent pho. You have to do the challenge. It's huge. I love pho but couldn't finish it.",
      "author": "Johnny A."
    }
  ],
  "aggregateRating": {
    "ratingValue": 4,
    "reviewCount": 316
  }
}